hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
/*
; stm32N657_eth.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_eth equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// ETH address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	MACCR;
	volatile	uint32_t	MACECR;
	volatile	uint32_t	MACPFR;
	volatile	uint32_t	MACWTR;
	volatile	uint32_t	MACHT0R;
	volatile	uint32_t	MACHT1R;
	volatile	uint32_t	RESERVED0[14];
	volatile	uint32_t	MACVTCR;
	volatile	uint32_t	MACVTDR;
	volatile	uint32_t	MACVHTR;
	volatile	uint32_t	RESERVED1;
		union {
	volatile	uint32_t	MACVIR;
	volatile	uint32_t	MACVIR_ALTERNATE;
		};
	volatile	uint32_t	MACIVIR;
	volatile	uint32_t	RESERVED2[2];
	volatile	uint32_t	MACQ0TXFCR;
	volatile	uint32_t	RESERVED3[7];
	volatile	uint32_t	MACRXFCR;
	volatile	uint32_t	MACRXQCR;
	volatile	uint32_t	RESERVED4[2];
	volatile	uint32_t	MACRXQC0R;
	volatile	uint32_t	MACRXQC1R;
	volatile	uint32_t	MACRXQC2R;
	volatile	uint32_t	RESERVED5;
	volatile	uint32_t	MACISR;
	volatile	uint32_t	MACIER;
	volatile	uint32_t	MACRXTXSR;
	volatile	uint32_t	RESERVED6;
	volatile	uint32_t	MACPCSR;
	volatile	uint32_t	MACRWKPFR;
	volatile	uint32_t	RESERVED7[2];
	volatile	uint32_t	MACLCSR;
	volatile	uint32_t	MACLTCR;
	volatile	uint32_t	MACLETR;
	volatile	uint32_t	MAC1USTCR;
	volatile	uint32_t	RESERVED8[6];
	volatile	uint32_t	MACPHYCSR;
	volatile	uint32_t	RESERVED9[5];
	volatile	uint32_t	MACVR;
	volatile	uint32_t	MACDR;
	volatile	uint32_t	RESERVED10;
	volatile	uint32_t	MACHWF0R;
	volatile	uint32_t	MACHWF1R;
	volatile	uint32_t	MACHWF2R;
	volatile	uint32_t	MACHWF3R;
	volatile	uint32_t	RESERVED11[53];
	volatile	uint32_t	MACMDIOAR;
	volatile	uint32_t	MACMDIODR;
	volatile	uint32_t	RESERVED12[2];
	volatile	uint32_t	MACARPAR;
	volatile	uint32_t	RESERVED13[7];
	volatile	uint32_t	MACCSRSWCR;
	volatile	uint32_t	MACFPECSR;
	volatile	uint32_t	RESERVED14[2];
	volatile	uint32_t	MACPRSTIMR;
	volatile	uint32_t	MACPRSTIMUR;
	volatile	uint32_t	RESERVED15[46];
	volatile	uint32_t	MACA0HR;
	volatile	uint32_t	MACA0LR;
	volatile	uint32_t	MACA1HR;
	volatile	uint32_t	MACA1LR;
	volatile	uint32_t	MACA2HR;
	volatile	uint32_t	MACA2LR;
	volatile	uint32_t	MACA3HR;
	volatile	uint32_t	MACA3LR;
	volatile	uint32_t	RESERVED16[248];
	volatile	uint32_t	MMC_CONTROL;
	volatile	uint32_t	MMC_RX_INTERRUPT;
	volatile	uint32_t	MMC_TX_INTERRUPT;
	volatile	uint32_t	MMC_RX_INTERRUPT_MASK;
	volatile	uint32_t	MMC_TX_INTERRUPT_MASK;
	volatile	uint32_t	RESERVED17[14];
	volatile	uint32_t	TX_SINGLE_COLLISION_GOOD_PACKETS;
	volatile	uint32_t	TX_MULTIPLE_COLLISION_GOOD_PACKETS;
	volatile	uint32_t	RESERVED18[5];
	volatile	uint32_t	TX_PACKET_COUNT_GOOD;
	volatile	uint32_t	RESERVED19[10];
	volatile	uint32_t	RX_CRC_ERROR_PACKETS;
	volatile	uint32_t	RX_ALIGNMENT_ERROR_PACKETS;
	volatile	uint32_t	RESERVED20[10];
	volatile	uint32_t	RX_UNICAST_PACKETS_GOOD;
	volatile	uint32_t	RESERVED21[9];
	volatile	uint32_t	TX_LPI_USEC_CNTR;
	volatile	uint32_t	TX_LPI_TRAN_CNTR;
	volatile	uint32_t	RX_LPI_USEC_CNTR;
	volatile	uint32_t	RX_LPI_TRAN_CNTR;
	volatile	uint32_t	RESERVED22[41];
	volatile	uint32_t	MMC_FPE_TX_ISR;
	volatile	uint32_t	MMC_FPE_TX_IMR;
	volatile	uint32_t	MMC_FPE_TX_FCR;
	volatile	uint32_t	MMC_TX_HRCR;
	volatile	uint32_t	RESERVED23[4];
	volatile	uint32_t	MMC_FPE_RX_ISR;
	volatile	uint32_t	MMC_FPE_RX_IMR;
	volatile	uint32_t	RX_PACKET_ASM_ERR;
	volatile	uint32_t	RX_PACKET_SMD_ERR;
	volatile	uint32_t	RX_PACKET_ASM_OKR;
	volatile	uint32_t	RX_FPE_FRAG_CR;
	volatile	uint32_t	RESERVED24[10];
	volatile	uint32_t	MACL3L4C0R;
	volatile	uint32_t	MACL4A0R;
	volatile	uint32_t	RESERVED25[2];
	volatile	uint32_t	MACL3A00R;
	volatile	uint32_t	MACL3A10R;
	volatile	uint32_t	MACL3A20R;
	volatile	uint32_t	MACL3A30R;
	volatile	uint32_t	RESERVED26[4];
	volatile	uint32_t	MACL3L4C1R;
	volatile	uint32_t	MACL4A1R;
	volatile	uint32_t	RESERVED27[2];
	volatile	uint32_t	MACL3A01R;
	volatile	uint32_t	MACL3A11R;
	volatile	uint32_t	MACL3A21R;
	volatile	uint32_t	MACL3A31R;
	volatile	uint32_t	RESERVED28[72];
	volatile	uint32_t	MAC_IACR;
	volatile	uint32_t	MAC_TMRQR;
	volatile	uint32_t	RESERVED29[34];
	volatile	uint32_t	MACTSCR;
	volatile	uint32_t	MACSSIR;
	volatile	uint32_t	MACSTSR;
	volatile	uint32_t	MACSTNR;
	volatile	uint32_t	MACSTSUR;
	volatile	uint32_t	MACSTNUR;
	volatile	uint32_t	MACTSAR;
	volatile	uint32_t	RESERVED30;
	volatile	uint32_t	MACTSSR;
	volatile	uint32_t	RESERVED31[3];
	volatile	uint32_t	MACTXTSSNR;
	volatile	uint32_t	MACTXTSSSR;
	volatile	uint32_t	RESERVED32[2];
	volatile	uint32_t	MACACR;
	volatile	uint32_t	RESERVED33;
	volatile	uint32_t	MACATSNR;
	volatile	uint32_t	MACATSSR;
	volatile	uint32_t	MACTSIACR;
	volatile	uint32_t	MACTSEACR;
	volatile	uint32_t	MACTSICNR;
	volatile	uint32_t	MACTSECNR;
	volatile	uint32_t	RESERVED34[2];
	volatile	uint32_t	MACTSILR;
	volatile	uint32_t	MACTSELR;
		union {
	volatile	uint32_t	MACPPSCR;
	volatile	uint32_t	MACPPSCR_ALTERNATE;
		};
	volatile	uint32_t	RESERVED35[3];
	volatile	uint32_t	MACPPSTTS0R;
	volatile	uint32_t	MACPPSTTN0R;
	volatile	uint32_t	MACPPSI0R;
	volatile	uint32_t	MACPPSW0R;
	volatile	uint32_t	MACPPSTTS1R;
	volatile	uint32_t	MACPPSTTN1R;
	volatile	uint32_t	MACPPSI1R;
	volatile	uint32_t	MACPPSW1R;
	volatile	uint32_t	RESERVED36[8];
	volatile	uint32_t	MACPOCR;
	volatile	uint32_t	MACSPI0R;
	volatile	uint32_t	MACSPI1R;
	volatile	uint32_t	MACSPI2R;
	volatile	uint32_t	MACLMIR;
	volatile	uint32_t	RESERVED37[11];
	volatile	uint32_t	MTLOMR;
	volatile	uint32_t	RESERVED38[7];
	volatile	uint32_t	MTLISR;
	volatile	uint32_t	RESERVED39[3];
	volatile	uint32_t	MTLRXQDMAMR;
	volatile	uint32_t	RESERVED40[3];
	volatile	uint32_t	MTLTBSCR;
	volatile	uint32_t	RESERVED41[3];
	volatile	uint32_t	MTLESTCR;
	volatile	uint32_t	MTLESTECR;
	volatile	uint32_t	MTLESTSR;
	volatile	uint32_t	RESERVED42;
	volatile	uint32_t	MTLESTSCHER;
	volatile	uint32_t	MTLESTFSER;
	volatile	uint32_t	MTLESTFSCR;
	volatile	uint32_t	RESERVED43;
	volatile	uint32_t	MTLESTIER;
	volatile	uint32_t	RESERVED44[3];
	volatile	uint32_t	MTLESTGCLCR;
	volatile	uint32_t	MTLESTGCLDR;
	volatile	uint32_t	RESERVED45[2];
	volatile	uint32_t	MTLFPECSR;
	volatile	uint32_t	MTLFPEAR;
	volatile	uint32_t	RESERVED46[26];
	volatile	uint32_t	MTLTXQ0OMR;
	volatile	uint32_t	MTLTXQ0UR;
	volatile	uint32_t	MTLTXQ0DR;
	volatile	uint32_t	RESERVED47[2];
	volatile	uint32_t	MTLTXQ0ESR;
	volatile	uint32_t	MTLTXQ0QWR;
	volatile	uint32_t	RESERVED48[4];
	volatile	uint32_t	MTLQ0ICSR;
	volatile	uint32_t	MTLRXQ0OMR;
	volatile	uint32_t	MTLRXQ0MPOCR;
	volatile	uint32_t	MTLRXQ0DR;
	volatile	uint32_t	MTLRXQ0CR;
	volatile	uint32_t	MTLTXQ1OMR;
	volatile	uint32_t	MTLTXQ1UR;
	volatile	uint32_t	MTLTXQ1DR;
	volatile	uint32_t	RESERVED49;
	volatile	uint32_t	MTLTXQ1ECR;
	volatile	uint32_t	MTLTXQ1ESR;
	volatile	uint32_t	MTLTXQ1QWR;
	volatile	uint32_t	MTLTXQ1SSCR;
	volatile	uint32_t	MTLTXQ1HCR;
	volatile	uint32_t	MTLTXQ1LCR;
	volatile	uint32_t	RESERVED50;
	volatile	uint32_t	MTLQ1ICSR;
	volatile	uint32_t	MTLRXQ1OMR;
	volatile	uint32_t	MTLRXQ1MPOCR;
	volatile	uint32_t	MTLRXQ1DR;
	volatile	uint32_t	MTLRXQ1CR;
	volatile	uint32_t	RESERVED51[160];
	volatile	uint32_t	DMAMR;
	volatile	uint32_t	DMASBMR;
	volatile	uint32_t	DMAISR;
	volatile	uint32_t	DMADSR;
	volatile	uint32_t	RESERVED52[4];
	volatile	uint32_t	DMAA4TXACR;
	volatile	uint32_t	DMAA4RXACR;
	volatile	uint32_t	DMAA4DACR;
	volatile	uint32_t	RESERVED53[5];
	volatile	uint32_t	DMALPIEI;
	volatile	uint32_t	RESERVED54[3];
	volatile	uint32_t	DMATBSCTRL0R;
	volatile	uint32_t	RESERVED55[43];
	volatile	uint32_t	DMAC0CR;
	volatile	uint32_t	DMAC0TXCR;
	volatile	uint32_t	DMAC0RXCR;
	volatile	uint32_t	RESERVED56[2];
	volatile	uint32_t	DMAC0TXDLAR;
	volatile	uint32_t	RESERVED57;
	volatile	uint32_t	DMAC0RXDLAR;
	volatile	uint32_t	DMAC0TXDTPR;
	volatile	uint32_t	RESERVED58;
	volatile	uint32_t	DMAC0RXDTPR;
	volatile	uint32_t	DMAC0TXRLR;
	volatile	uint32_t	DMAC0RXRLR;
	volatile	uint32_t	DMAC0IER;
	volatile	uint32_t	DMAC0RXIWTR;
	volatile	uint32_t	DMAC0SFCSR;
	volatile	uint32_t	RESERVED59;
	volatile	uint32_t	DMAC0CATXDR;
	volatile	uint32_t	RESERVED60;
	volatile	uint32_t	DMAC0CARXDR;
	volatile	uint32_t	RESERVED61;
	volatile	uint32_t	DMAC0CATXBR;
	volatile	uint32_t	RESERVED62;
	volatile	uint32_t	DMAC0CARXBR;
	volatile	uint32_t	DMAC0SR;
	volatile	uint32_t	DMAC0MFCR;
	volatile	uint32_t	RESERVED63[6];
	volatile	uint32_t	DMAC1CR;
	volatile	uint32_t	DMAC1TXCR;
	volatile	uint32_t	DMAC1RXCR;
	volatile	uint32_t	RESERVED64[2];
	volatile	uint32_t	DMAC1TXDLAR;
	volatile	uint32_t	RESERVED65[2];
	volatile	uint32_t	DMAC1TXDTPR;
	volatile	uint32_t	RESERVED66;
	volatile	uint32_t	DMAC1RXDTPR;
	volatile	uint32_t	DMAC1TXRLR;
	volatile	uint32_t	DMAC1RXRLR;
	volatile	uint32_t	DMAC1IER;
	volatile	uint32_t	DMAC1RXIWTR;
	volatile	uint32_t	DMAC1SFCSR;
	volatile	uint32_t	RESERVED67;
	volatile	uint32_t	DMAC1CATXDR;
	volatile	uint32_t	RESERVED68;
	volatile	uint32_t	DMAC1CARXDR;
	volatile	uint32_t	RESERVED69;
	volatile	uint32_t	DMAC1CATXBR;
	volatile	uint32_t	RESERVED70;
	volatile	uint32_t	DMAC1CARXBR;
	volatile	uint32_t	DMAC1SR;
	volatile	uint32_t	DMAC1MFCR;
} ETH_TypeDef;

#if (defined(__cplusplus))
#define	ETH_NS	reinterpret_cast<ETH_TypeDef *>(0x48036000u)
#define	ETH_S	reinterpret_cast<ETH_TypeDef *>(0x58036000u)

#else
#define	ETH_NS	((ETH_TypeDef *)0x48036000u)
#define	ETH_S	((ETH_TypeDef *)0x58036000u)
#endif

// MACCR Configuration

#define	ETH_MACCR_ARPEN										(0x1u<<31)
#define	ETH_MACCR_SARC										(0x7u<<28)
#define	ETH_MACCR_SARC_0									(0x1u<<28)
#define	ETH_MACCR_IPC										(0x1u<<27)
#define	ETH_MACCR_IPG										(0x7u<<24)
#define	ETH_MACCR_IPG_0										(0x1u<<24)
#define	ETH_MACCR_GPSLCE									(0x1u<<23)
#define	ETH_MACCR_S2KP										(0x1u<<22)
#define	ETH_MACCR_CST										(0x1u<<21)
#define	ETH_MACCR_ACS										(0x1u<<20)
#define	ETH_MACCR_WD										(0x1u<<19)
#define	ETH_MACCR_BE										(0x1u<<18)
#define	ETH_MACCR_JD										(0x1u<<17)
#define	ETH_MACCR_JE										(0x1u<<16)
#define	ETH_MACCR_PS										(0x1u<<15)
#define	ETH_MACCR_FES										(0x1u<<14)
#define	ETH_MACCR_DM										(0x1u<<13)
#define	ETH_MACCR_LM										(0x1u<<12)
#define	ETH_MACCR_ECRSFD									(0x1u<<11)
#define	ETH_MACCR_DO										(0x1u<<10)
#define	ETH_MACCR_DCRS										(0x1u<<9)
#define	ETH_MACCR_DR										(0x1u<<8)
#define	ETH_MACCR_BL										(0x3u<<5)
#define	ETH_MACCR_BL_0										(0x1u<<5)
#define	ETH_MACCR_DC										(0x1u<<4)
#define	ETH_MACCR_PRELEN									(0x3u<<2)
#define	ETH_MACCR_PRELEN_0									(0x1u<<2)
#define	ETH_MACCR_TE										(0x1u<<1)
#define	ETH_MACCR_RE										(0x1u<<0)

