hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MACCR_SARC_B_0X2								(0x2u<<28)
#define	ETH_MACCR_SARC_B_0X3								(0x3u<<28)
#define	ETH_MACCR_SARC_B_0X6								(0x6u<<28)
#define	ETH_MACCR_SARC_B_0X7								(0x7u<<28)
#define	ETH_MACCR_IPG_B_0X0									(0x0u<<24)
#define	ETH_MACCR_IPG_B_0X1									(0x1u<<24)
#define	ETH_MACCR_IPG_B_0X2									(0x2u<<24)
#define	ETH_MACCR_IPG_B_0X7									(0x7u<<24)
#define	ETH_MACCR_PS_B_0X0									(0x0u<<15)
#define	ETH_MACCR_PS_B_0X1									(0x1u<<15)
#define	ETH_MACCR_FES_B_0X0									(0x0u<<14)
#define	ETH_MACCR_FES_B_0X1									(0x1u<<14)
#define	ETH_MACCR_BL_B_0X0									(0x0u<<5)
#define	ETH_MACCR_BL_B_0X1									(0x1u<<5)
#define	ETH_MACCR_BL_B_0X2									(0x2u<<5)
#define	ETH_MACCR_BL_B_0X3									(0x3u<<5)
#define	ETH_MACCR_PRELEN_B_0X0								(0x0u<<2)
#define	ETH_MACCR_PRELEN_B_0X1								(0x1u<<2)
#define	ETH_MACCR_PRELEN_B_0X2								(0x2u<<2)

// MACECR Configuration

#define	ETH_MACECR_APDIM									(0x1u<<30)
#define	ETH_MACECR_EIPG										(0x1Fu<<25)
#define	ETH_MACECR_EIPG_0									(0x1u<<25)
#define	ETH_MACECR_EIPGEN									(0x1u<<24)
#define	ETH_MACECR_USP										(0x1u<<18)
#define	ETH_MACECR_SPEN										(0x1u<<17)
#define	ETH_MACECR_DCRCC									(0x1u<<16)
#define	ETH_MACECR_GPSL										(0x3FFFu<<0)
#define	ETH_MACECR_GPSL_0									(0x1u<<0)

// MACPFR Configuration

#define	ETH_MACPFR_RA										(0x1u<<31)
#define	ETH_MACPFR_DNTU										(0x1u<<21)
#define	ETH_MACPFR_IPFE										(0x1u<<20)
#define	ETH_MACPFR_VTFE										(0x1u<<16)
#define	ETH_MACPFR_HPF										(0x1u<<10)
#define	ETH_MACPFR_SAF										(0x1u<<9)
#define	ETH_MACPFR_SAIF										(0x1u<<8)
#define	ETH_MACPFR_PCF										(0x3u<<6)
#define	ETH_MACPFR_PCF_0									(0x1u<<6)
#define	ETH_MACPFR_DBF										(0x1u<<5)
#define	ETH_MACPFR_PM										(0x1u<<4)
#define	ETH_MACPFR_DAIF										(0x1u<<3)
#define	ETH_MACPFR_HMC										(0x1u<<2)
#define	ETH_MACPFR_HUC										(0x1u<<1)
#define	ETH_MACPFR_PR										(0x1u<<0)

#define	ETH_MACPFR_PCF_B_0X0								(0x0u<<6)
#define	ETH_MACPFR_PCF_B_0X1								(0x1u<<6)
#define	ETH_MACPFR_PCF_B_0X2								(0x2u<<6)
#define	ETH_MACPFR_PCF_B_0X3								(0x3u<<6)

// MACWTR Configuration

#define	ETH_MACWTR_PWE										(0x1u<<8)
#define	ETH_MACWTR_WTO										(0xFu<<0)
#define	ETH_MACWTR_WTO_0									(0x1u<<0)

#define	ETH_MACWTR_WTO_B_0X0								(0x0u<<0)
#define	ETH_MACWTR_WTO_B_0X1								(0x1u<<0)
#define	ETH_MACWTR_WTO_B_0X2								(0x2u<<0)
#define	ETH_MACWTR_WTO_B_0X3								(0x3u<<0)
#define	ETH_MACWTR_WTO_B_0XC								(0xCu<<0)
#define	ETH_MACWTR_WTO_B_0XD								(0xDu<<0)
#define	ETH_MACWTR_WTO_B_0XE								(0xEu<<0)

// MACHT0R Configuration

#define	ETH_MACHT0R_HT31T0									(0xFFFFFFFFu<<0)
#define	ETH_MACHT0R_HT31T0_0								(0x1u<<0)

// MACHT1R Configuration

#define	ETH_MACHT1R_HT63T32									(0xFFFFFFFFu<<0)
#define	ETH_MACHT1R_HT63T32_0								(0x1u<<0)

// MACVTCR Configuration

#define	ETH_MACVTCR_EIVLRXS									(0x1u<<31)
#define	ETH_MACVTCR_EIVLS									(0x3u<<28)
#define	ETH_MACVTCR_EIVLS_0									(0x1u<<28)
#define	ETH_MACVTCR_ERIVLT									(0x1u<<27)
#define	ETH_MACVTCR_EDVLP									(0x1u<<26)
#define	ETH_MACVTCR_VTHM									(0x1u<<25)
#define	ETH_MACVTCR_EVLRXS									(0x1u<<24)
#define	ETH_MACVTCR_EVLS									(0x3u<<21)
#define	ETH_MACVTCR_EVLS_0									(0x1u<<21)
#define	ETH_MACVTCR_DOVLTC									(0x1u<<20)
#define	ETH_MACVTCR_ERSVLM									(0x1u<<19)
#define	ETH_MACVTCR_ESVL									(0x1u<<18)
#define	ETH_MACVTCR_VTIM									(0x1u<<17)
#define	ETH_MACVTCR_ETV										(0x1u<<16)
#define	ETH_MACVTCR_OFS										(0x3u<<2)
#define	ETH_MACVTCR_OFS_0									(0x1u<<2)
#define	ETH_MACVTCR_CT										(0x1u<<1)
#define	ETH_MACVTCR_OB										(0x1u<<0)

#define	ETH_MACVTCR_EIVLS_B_0X0								(0x0u<<28)
#define	ETH_MACVTCR_EIVLS_B_0X1								(0x1u<<28)
#define	ETH_MACVTCR_EIVLS_B_0X2								(0x2u<<28)
#define	ETH_MACVTCR_EIVLS_B_0X3								(0x3u<<28)
#define	ETH_MACVTCR_EVLS_B_0X0								(0x0u<<21)
#define	ETH_MACVTCR_EVLS_B_0X1								(0x1u<<21)
#define	ETH_MACVTCR_EVLS_B_0X2								(0x2u<<21)
#define	ETH_MACVTCR_EVLS_B_0X3								(0x3u<<21)
#define	ETH_MACVTCR_OFS_B_0X0								(0x0u<<2)
#define	ETH_MACVTCR_OFS_B_0X1								(0x1u<<2)
#define	ETH_MACVTCR_OFS_B_0X2								(0x2u<<2)
#define	ETH_MACVTCR_OFS_B_0X3								(0x3u<<2)

// MACVTDR Configuration

#define	ETH_MACVTDR_DMACHN									(0x1u<<25)
#define	ETH_MACVTDR_DMACHEN									(0x1u<<24)
#define	ETH_MACVTDR_ERIVLT									(0x1u<<20)
#define	ETH_MACVTDR_ERSVLM									(0x1u<<19)
#define	ETH_MACVTDR_DOVLTC									(0x1u<<18)
#define	ETH_MACVTDR_ETV										(0x1u<<17)
#define	ETH_MACVTDR_VEN										(0x1u<<16)
#define	ETH_MACVTDR_VID										(0xFFFFu<<0)
#define	ETH_MACVTDR_VID_0									(0x1u<<0)

#define	ETH_MACVTDR_ETV_B_0X0								(0x0u<<17)
#define	ETH_MACVTDR_ETV_B_0X1								(0x1u<<17)

// MACVHTR Configuration

#define	ETH_MACVHTR_VLHT									(0xFFFFu<<0)
#define	ETH_MACVHTR_VLHT_0									(0x1u<<0)

// MACVIR Configuration

#define	ETH_MACVIR_BUSY										(0x1u<<31)
#define	ETH_MACVIR_RDWR										(0x1u<<30)
#define	ETH_MACVIR_ADDR										(0x1u<<24)
#define	ETH_MACVIR_CBTI										(0x1u<<21)
#define	ETH_MACVIR_VLTI										(0x1u<<20)
#define	ETH_MACVIR_CSVL										(0x1u<<19)
#define	ETH_MACVIR_VLP										(0x1u<<18)
#define	ETH_MACVIR_VLC										(0x3u<<16)
#define	ETH_MACVIR_VLC_0									(0x1u<<16)
#define	ETH_MACVIR_VLT										(0xFFFFu<<0)
#define	ETH_MACVIR_VLT_0									(0x1u<<0)

#define	ETH_MACVIR_ADDR_B_0X0								(0x0u<<24)
#define	ETH_MACVIR_ADDR_B_0X1								(0x1u<<24)
#define	ETH_MACVIR_CSVL_B_0X0								(0x0u<<19)
#define	ETH_MACVIR_CSVL_B_0X1								(0x1u<<19)
#define	ETH_MACVIR_VLC_B_0X0								(0x0u<<16)
#define	ETH_MACVIR_VLC_B_0X1								(0x1u<<16)
#define	ETH_MACVIR_VLC_B_0X2								(0x2u<<16)
#define	ETH_MACVIR_VLC_B_0X3								(0x3u<<16)

// MACVIR_ALTERNATE Configuration

#define	ETH_MACVIR_ALTERNATE_CSVL							(0x1u<<19)
#define	ETH_MACVIR_ALTERNATE_VLT							(0xFFFFu<<0)
#define	ETH_MACVIR_ALTERNATE_VLT_0							(0x1u<<0)

#define	ETH_MACVIR_ALTERNATE_CSVL_B_0X0						(0x0u<<19)
#define	ETH_MACVIR_ALTERNATE_CSVL_B_0X1						(0x1u<<19)

