hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
// MACIVIR Configuration

#define	ETH_MACIVIR_VLTI									(0x1u<<20)
#define	ETH_MACIVIR_CSVL									(0x1u<<19)
#define	ETH_MACIVIR_VLP										(0x1u<<18)
#define	ETH_MACIVIR_VLC										(0x3u<<16)
#define	ETH_MACIVIR_VLC_0									(0x1u<<16)
#define	ETH_MACIVIR_VLT										(0xFFFFu<<0)
#define	ETH_MACIVIR_VLT_0									(0x1u<<0)

#define	ETH_MACIVIR_CSVL_B_0X0								(0x0u<<19)
#define	ETH_MACIVIR_CSVL_B_0X1								(0x1u<<19)
#define	ETH_MACIVIR_VLC_B_0X0								(0x0u<<16)
#define	ETH_MACIVIR_VLC_B_0X1								(0x1u<<16)
#define	ETH_MACIVIR_VLC_B_0X2								(0x2u<<16)
#define	ETH_MACIVIR_VLC_B_0X3								(0x3u<<16)

// MACQ0TXFCR Configuration

#define	ETH_MACQ0TXFCR_PT									(0xFFFFu<<16)
#define	ETH_MACQ0TXFCR_PT_0									(0x1u<<16)
#define	ETH_MACQ0TXFCR_DZPQ									(0x1u<<7)
#define	ETH_MACQ0TXFCR_PLT									(0x7u<<4)
#define	ETH_MACQ0TXFCR_PLT_0								(0x1u<<4)
#define	ETH_MACQ0TXFCR_TFE									(0x1u<<1)
#define	ETH_MACQ0TXFCR_FCB_BPA								(0x1u<<0)

#define	ETH_MACQ0TXFCR_PLT_B_0X0							(0x0u<<4)
#define	ETH_MACQ0TXFCR_PLT_B_0X1							(0x1u<<4)
#define	ETH_MACQ0TXFCR_PLT_B_0X2							(0x2u<<4)
#define	ETH_MACQ0TXFCR_PLT_B_0X3							(0x3u<<4)
#define	ETH_MACQ0TXFCR_PLT_B_0X4							(0x4u<<4)
#define	ETH_MACQ0TXFCR_PLT_B_0X5							(0x5u<<4)

// MACRXFCR Configuration

#define	ETH_MACRXFCR_UP										(0x1u<<1)
#define	ETH_MACRXFCR_RFE									(0x1u<<0)

// MACRXQCR Configuration

#define	ETH_MACRXQCR_VFFQ									(0x1u<<17)
#define	ETH_MACRXQCR_VFFQE									(0x1u<<16)
#define	ETH_MACRXQCR_MFFQ									(0x1u<<9)
#define	ETH_MACRXQCR_MFFQE									(0x1u<<8)
#define	ETH_MACRXQCR_UFFQ									(0x1u<<1)
#define	ETH_MACRXQCR_UFFQE									(0x1u<<0)

#define	ETH_MACRXQCR_VFFQ_B_0X0								(0x0u<<17)
#define	ETH_MACRXQCR_VFFQ_B_0X1								(0x1u<<17)
#define	ETH_MACRXQCR_VFFQE_B_0X0							(0x0u<<16)
#define	ETH_MACRXQCR_VFFQE_B_0X1							(0x1u<<16)
#define	ETH_MACRXQCR_MFFQ_B_0X0								(0x0u<<9)
#define	ETH_MACRXQCR_MFFQ_B_0X1								(0x1u<<9)
#define	ETH_MACRXQCR_UFFQ_B_0X0								(0x0u<<1)
#define	ETH_MACRXQCR_UFFQ_B_0X1								(0x1u<<1)

// MACRXQC0R Configuration

#define	ETH_MACRXQC0R_RXQ1EN								(0x3u<<2)
#define	ETH_MACRXQC0R_RXQ1EN_0								(0x1u<<2)
#define	ETH_MACRXQC0R_RXQ0EN								(0x3u<<0)
#define	ETH_MACRXQC0R_RXQ0EN_0								(0x1u<<0)

#define	ETH_MACRXQC0R_RXQ1EN_B_0X0							(0x0u<<2)
#define	ETH_MACRXQC0R_RXQ1EN_B_0X1							(0x1u<<2)
#define	ETH_MACRXQC0R_RXQ1EN_B_0X2							(0x2u<<2)
#define	ETH_MACRXQC0R_RXQ0EN_B_0X0							(0x0u<<0)
#define	ETH_MACRXQC0R_RXQ0EN_B_0X1							(0x1u<<0)
#define	ETH_MACRXQC0R_RXQ0EN_B_0X2							(0x2u<<0)

// MACRXQC1R Configuration

#define	ETH_MACRXQC1R_TBRQE									(0x1u<<29)
#define	ETH_MACRXQC1R_OMCBCQ								(0x1u<<28)
#define	ETH_MACRXQC1R_FPRQ2									(0x1u<<26)
#define	ETH_MACRXQC1R_FPRQ1									(0x1u<<25)
#define	ETH_MACRXQC1R_FPRQ0									(0x1u<<24)
#define	ETH_MACRXQC1R_TPQC									(0x3u<<22)
#define	ETH_MACRXQC1R_TPQC_0								(0x1u<<22)
#define	ETH_MACRXQC1R_TACPQE								(0x1u<<21)
#define	ETH_MACRXQC1R_MCBCQEN								(0x1u<<20)
#define	ETH_MACRXQC1R_MCBCQ									(0x7u<<16)
#define	ETH_MACRXQC1R_MCBCQ_0								(0x1u<<16)
#define	ETH_MACRXQC1R_UPQ									(0x7u<<12)
#define	ETH_MACRXQC1R_UPQ_0									(0x1u<<12)
#define	ETH_MACRXQC1R_PTPQ									(0x7u<<4)
#define	ETH_MACRXQC1R_PTPQ_0								(0x1u<<4)
#define	ETH_MACRXQC1R_AVCPQ2								(0x1u<<2)
#define	ETH_MACRXQC1R_AVCPQ1								(0x1u<<1)
#define	ETH_MACRXQC1R_AVCPQ0								(0x1u<<0)

#define	ETH_MACRXQC1R_OMCBCQ_B_0X1							(0x1u<<28)
#define	ETH_MACRXQC1R_OMCBCQ_B_0X0							(0x0u<<28)
#define	ETH_MACRXQC1R_FPRQ2_B_0X1							(0x1u<<26)
#define	ETH_MACRXQC1R_FPRQ1_B_0X1							(0x1u<<25)
#define	ETH_MACRXQC1R_FPRQ0_B_0X1							(0x1u<<24)
#define	ETH_MACRXQC1R_TPQC_B_0X0							(0x0u<<22)
#define	ETH_MACRXQC1R_TPQC_B_0X1							(0x1u<<22)
#define	ETH_MACRXQC1R_TPQC_B_0X2							(0x2u<<22)
#define	ETH_MACRXQC1R_MCBCQ_B_0X0							(0x0u<<16)
#define	ETH_MACRXQC1R_MCBCQ_B_0X1							(0x1u<<16)
#define	ETH_MACRXQC1R_UPQ_B_0X0								(0x0u<<12)
#define	ETH_MACRXQC1R_UPQ_B_0X1								(0x1u<<12)
#define	ETH_MACRXQC1R_PTPQ_B_0X0							(0x0u<<4)
#define	ETH_MACRXQC1R_PTPQ_B_0X1							(0x1u<<4)
#define	ETH_MACRXQC1R_AVCPQ2_B_0X0							(0x0u<<2)
#define	ETH_MACRXQC1R_AVCPQ2_B_0X1							(0x1u<<2)
#define	ETH_MACRXQC1R_AVCPQ1_B_0X0							(0x0u<<1)
#define	ETH_MACRXQC1R_AVCPQ1_B_0X1							(0x1u<<1)
#define	ETH_MACRXQC1R_AVCPQ0_B_0X0							(0x0u<<0)
#define	ETH_MACRXQC1R_AVCPQ0_B_0X1							(0x1u<<0)

// MACRXQC2R Configuration

#define	ETH_MACRXQC2R_PSRQ1									(0xFFu<<8)
#define	ETH_MACRXQC2R_PSRQ1_0								(0x1u<<8)
#define	ETH_MACRXQC2R_PSRQ0									(0xFFu<<0)
#define	ETH_MACRXQC2R_PSRQ0_0								(0x1u<<0)

// MACISR Configuration

#define	ETH_MACISR_MFRIS									(0x1u<<20)
#define	ETH_MACISR_MFTIS									(0x1u<<19)
#define	ETH_MACISR_MDIOIS									(0x1u<<18)
#define	ETH_MACISR_FPEIS									(0x1u<<17)
#define	ETH_MACISR_RXSTSIS									(0x1u<<14)
#define	ETH_MACISR_TXSTSIS									(0x1u<<13)
#define	ETH_MACISR_TSIS										(0x1u<<12)
#define	ETH_MACISR_MMCTXIS									(0x1u<<10)
#define	ETH_MACISR_MMCRXIS									(0x1u<<9)
#define	ETH_MACISR_MMCIS									(0x1u<<8)
#define	ETH_MACISR_LPIIS									(0x1u<<5)
#define	ETH_MACISR_PMTIS									(0x1u<<4)
#define	ETH_MACISR_PHYIS									(0x1u<<3)
#define	ETH_MACISR_RGSMIIIS									(0x1u<<0)

// MACIER Configuration

#define	ETH_MACIER_MDIOIE									(0x1u<<18)
#define	ETH_MACIER_FPEIE									(0x1u<<17)
#define	ETH_MACIER_RXSTSIE									(0x1u<<14)
#define	ETH_MACIER_TXSTSIE									(0x1u<<13)
#define	ETH_MACIER_TSIE										(0x1u<<12)
#define	ETH_MACIER_LPIIE									(0x1u<<5)
#define	ETH_MACIER_PMTIE									(0x1u<<4)
#define	ETH_MACIER_PHYIE									(0x1u<<3)
#define	ETH_MACIER_RGSMIIIE									(0x1u<<0)

// MACRXTXSR Configuration

#define	ETH_MACRXTXSR_RWT									(0x1u<<8)
#define	ETH_MACRXTXSR_EXCOL									(0x1u<<5)
#define	ETH_MACRXTXSR_LCOL									(0x1u<<4)
#define	ETH_MACRXTXSR_EXDEF									(0x1u<<3)
#define	ETH_MACRXTXSR_LCARR									(0x1u<<2)
#define	ETH_MACRXTXSR_NCARR									(0x1u<<1)
#define	ETH_MACRXTXSR_TJT									(0x1u<<0)

// MACPCSR Configuration

#define	ETH_MACPCSR_RWKFILTRST								(0x1u<<31)
#define	ETH_MACPCSR_RWKPTR									(0x1Fu<<24)
#define	ETH_MACPCSR_RWKPTR_0								(0x1u<<24)
#define	ETH_MACPCSR_RWKPFE									(0x1u<<10)
#define	ETH_MACPCSR_GLBLUCAST								(0x1u<<9)
#define	ETH_MACPCSR_RWKPRCVD								(0x1u<<6)
#define	ETH_MACPCSR_MGKPRCVD								(0x1u<<5)
#define	ETH_MACPCSR_RWKPKTEN								(0x1u<<2)
#define	ETH_MACPCSR_MGKPKTEN								(0x1u<<1)
#define	ETH_MACPCSR_PWRDWN									(0x1u<<0)

