hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MACHWF2R_AUXSNAPNUM								(0x7u<<28)
#define	ETH_MACHWF2R_AUXSNAPNUM_0							(0x1u<<28)
#define	ETH_MACHWF2R_PPSOUTNUM								(0x7u<<24)
#define	ETH_MACHWF2R_PPSOUTNUM_0							(0x1u<<24)
#define	ETH_MACHWF2R_TDCSZ									(0x3u<<22)
#define	ETH_MACHWF2R_TDCSZ_0								(0x1u<<22)
#define	ETH_MACHWF2R_TXCHCNT								(0xFu<<18)
#define	ETH_MACHWF2R_TXCHCNT_0								(0x1u<<18)
#define	ETH_MACHWF2R_RDCSZ									(0x3u<<16)
#define	ETH_MACHWF2R_RDCSZ_0								(0x1u<<16)
#define	ETH_MACHWF2R_RXCHCNT								(0xFu<<12)
#define	ETH_MACHWF2R_RXCHCNT_0								(0x1u<<12)
#define	ETH_MACHWF2R_TXQCNT									(0xFu<<6)
#define	ETH_MACHWF2R_TXQCNT_0								(0x1u<<6)
#define	ETH_MACHWF2R_RXQCNT									(0xFu<<0)
#define	ETH_MACHWF2R_RXQCNT_0								(0x1u<<0)

#define	ETH_MACHWF2R_AUXSNAPNUM_B_0X0						(0x0u<<28)
#define	ETH_MACHWF2R_AUXSNAPNUM_B_0X1						(0x1u<<28)
#define	ETH_MACHWF2R_AUXSNAPNUM_B_0X2						(0x2u<<28)
#define	ETH_MACHWF2R_AUXSNAPNUM_B_0X3						(0x3u<<28)
#define	ETH_MACHWF2R_AUXSNAPNUM_B_0X4						(0x4u<<28)
#define	ETH_MACHWF2R_PPSOUTNUM_B_0X0						(0x0u<<24)
#define	ETH_MACHWF2R_PPSOUTNUM_B_0X1						(0x1u<<24)
#define	ETH_MACHWF2R_PPSOUTNUM_B_0X2						(0x2u<<24)
#define	ETH_MACHWF2R_PPSOUTNUM_B_0X3						(0x3u<<24)
#define	ETH_MACHWF2R_PPSOUTNUM_B_0X4						(0x4u<<24)
#define	ETH_MACHWF2R_TDCSZ_B_0X0							(0x0u<<22)
#define	ETH_MACHWF2R_TDCSZ_B_0X1							(0x1u<<22)
#define	ETH_MACHWF2R_TDCSZ_B_0X2							(0x2u<<22)
#define	ETH_MACHWF2R_TDCSZ_B_0X3							(0x3u<<22)
#define	ETH_MACHWF2R_TXCHCNT_B_0X0							(0x0u<<18)
#define	ETH_MACHWF2R_TXCHCNT_B_0X1							(0x1u<<18)
#define	ETH_MACHWF2R_TXCHCNT_B_0X7							(0x7u<<18)
#define	ETH_MACHWF2R_RDCSZ_B_0X0							(0x0u<<16)
#define	ETH_MACHWF2R_RDCSZ_B_0X1							(0x1u<<16)
#define	ETH_MACHWF2R_RDCSZ_B_0X2							(0x2u<<16)
#define	ETH_MACHWF2R_RDCSZ_B_0X3							(0x3u<<16)
#define	ETH_MACHWF2R_RXCHCNT_B_0X0							(0x0u<<12)
#define	ETH_MACHWF2R_RXCHCNT_B_0X1							(0x1u<<12)
#define	ETH_MACHWF2R_RXCHCNT_B_0X7							(0x7u<<12)
#define	ETH_MACHWF2R_TXQCNT_B_0X0							(0x0u<<6)
#define	ETH_MACHWF2R_TXQCNT_B_0X1							(0x1u<<6)
#define	ETH_MACHWF2R_TXQCNT_B_0X7							(0x7u<<6)
#define	ETH_MACHWF2R_RXQCNT_B_0X0							(0x0u<<0)
#define	ETH_MACHWF2R_RXQCNT_B_0X1							(0x1u<<0)
#define	ETH_MACHWF2R_RXQCNT_B_0X7							(0x7u<<0)

// MACHWF3R Configuration

#define	ETH_MACHWF3R_ASP									(0x3u<<28)
#define	ETH_MACHWF3R_ASP_0									(0x1u<<28)
#define	ETH_MACHWF3R_TBSSEL									(0x1u<<27)
#define	ETH_MACHWF3R_FPESEL									(0x1u<<26)
#define	ETH_MACHWF3R_ESTWID									(0x3u<<20)
#define	ETH_MACHWF3R_ESTWID_0								(0x1u<<20)
#define	ETH_MACHWF3R_ESTDEP									(0x7u<<17)
#define	ETH_MACHWF3R_ESTDEP_0								(0x1u<<17)
#define	ETH_MACHWF3R_ESTSEL									(0x1u<<16)
#define	ETH_MACHWF3R_FRPES									(0x3u<<13)
#define	ETH_MACHWF3R_FRPES_0								(0x1u<<13)
#define	ETH_MACHWF3R_FRPBS									(0x3u<<11)
#define	ETH_MACHWF3R_FRPBS_0								(0x1u<<11)
#define	ETH_MACHWF3R_FRPSEL									(0x1u<<10)
#define	ETH_MACHWF3R_PDUPSEL								(0x1u<<9)
#define	ETH_MACHWF3R_DVLAN									(0x1u<<5)
#define	ETH_MACHWF3R_CBTISEL								(0x1u<<4)
#define	ETH_MACHWF3R_NRVF									(0x7u<<0)
#define	ETH_MACHWF3R_NRVF_0									(0x1u<<0)

#define	ETH_MACHWF3R_ASP_B_0X0								(0x0u<<28)
#define	ETH_MACHWF3R_ASP_B_0X1								(0x1u<<28)
#define	ETH_MACHWF3R_ASP_B_0X2								(0x2u<<28)
#define	ETH_MACHWF3R_ASP_B_0X3								(0x3u<<28)
#define	ETH_MACHWF3R_ESTWID_B_0X0							(0x0u<<20)
#define	ETH_MACHWF3R_ESTWID_B_0X1							(0x1u<<20)
#define	ETH_MACHWF3R_ESTWID_B_0X2							(0x2u<<20)
#define	ETH_MACHWF3R_ESTWID_B_0X3							(0x3u<<20)
#define	ETH_MACHWF3R_ESTDEP_B_0X0							(0x0u<<17)
#define	ETH_MACHWF3R_ESTDEP_B_0X1							(0x1u<<17)
#define	ETH_MACHWF3R_ESTDEP_B_0X2							(0x2u<<17)
#define	ETH_MACHWF3R_ESTDEP_B_0X3							(0x3u<<17)
#define	ETH_MACHWF3R_ESTDEP_B_0X4							(0x4u<<17)
#define	ETH_MACHWF3R_ESTDEP_B_0X5							(0x5u<<17)
#define	ETH_MACHWF3R_FRPES_B_0X0							(0x0u<<13)
#define	ETH_MACHWF3R_FRPES_B_0X1							(0x1u<<13)
#define	ETH_MACHWF3R_FRPES_B_0X2							(0x2u<<13)
#define	ETH_MACHWF3R_FRPBS_B_0X0							(0x0u<<11)
#define	ETH_MACHWF3R_FRPBS_B_0X1							(0x1u<<11)
#define	ETH_MACHWF3R_FRPBS_B_0X2							(0x2u<<11)
#define	ETH_MACHWF3R_NRVF_B_0X0								(0x0u<<0)
#define	ETH_MACHWF3R_NRVF_B_0X1								(0x1u<<0)
#define	ETH_MACHWF3R_NRVF_B_0X2								(0x2u<<0)
#define	ETH_MACHWF3R_NRVF_B_0X3								(0x3u<<0)
#define	ETH_MACHWF3R_NRVF_B_0X4								(0x4u<<0)
#define	ETH_MACHWF3R_NRVF_B_0X5								(0x5u<<0)

// MACMDIOAR Configuration

#define	ETH_MACMDIOAR_PSE									(0x1u<<27)
#define	ETH_MACMDIOAR_BTB									(0x1u<<26)
#define	ETH_MACMDIOAR_PA									(0x1Fu<<21)
#define	ETH_MACMDIOAR_PA_0									(0x1u<<21)
#define	ETH_MACMDIOAR_RDA									(0x1Fu<<16)
#define	ETH_MACMDIOAR_RDA_0									(0x1u<<16)
#define	ETH_MACMDIOAR_NTC									(0x7u<<12)
#define	ETH_MACMDIOAR_NTC_0									(0x1u<<12)
#define	ETH_MACMDIOAR_CR									(0xFu<<8)
#define	ETH_MACMDIOAR_CR_0									(0x1u<<8)
#define	ETH_MACMDIOAR_SKAP									(0x1u<<4)
#define	ETH_MACMDIOAR_GOC									(0x3u<<2)
#define	ETH_MACMDIOAR_GOC_0									(0x1u<<2)
#define	ETH_MACMDIOAR_C45E									(0x1u<<1)
#define	ETH_MACMDIOAR_GB									(0x1u<<0)

#define	ETH_MACMDIOAR_CR_B_0X0								(0x0u<<8)
#define	ETH_MACMDIOAR_CR_B_0X1								(0x1u<<8)
#define	ETH_MACMDIOAR_CR_B_0X2								(0x2u<<8)
#define	ETH_MACMDIOAR_CR_B_0X3								(0x3u<<8)
#define	ETH_MACMDIOAR_CR_B_0X4								(0x4u<<8)
#define	ETH_MACMDIOAR_CR_B_0X5								(0x5u<<8)
#define	ETH_MACMDIOAR_CR_B_0X6								(0x6u<<8)
#define	ETH_MACMDIOAR_CR_B_0X7								(0x7u<<8)
#define	ETH_MACMDIOAR_CR_B_0X8								(0x8u<<8)
#define	ETH_MACMDIOAR_CR_B_0X9								(0x9u<<8)
#define	ETH_MACMDIOAR_CR_B_0XA								(0xAu<<8)
#define	ETH_MACMDIOAR_CR_B_0XB								(0xBu<<8)
#define	ETH_MACMDIOAR_CR_B_0XC								(0xCu<<8)
#define	ETH_MACMDIOAR_CR_B_0XD								(0xDu<<8)
#define	ETH_MACMDIOAR_CR_B_0XE								(0xEu<<8)
#define	ETH_MACMDIOAR_CR_B_0XF								(0xFu<<8)
#define	ETH_MACMDIOAR_GOC_B_0X1								(0x1u<<2)
#define	ETH_MACMDIOAR_GOC_B_0X2								(0x2u<<2)
#define	ETH_MACMDIOAR_GOC_B_0X3								(0x3u<<2)

// MACMDIODR Configuration

#define	ETH_MACMDIODR_RA									(0xFFFFu<<16)
#define	ETH_MACMDIODR_RA_0									(0x1u<<16)
#define	ETH_MACMDIODR_GD									(0xFFFFu<<0)
#define	ETH_MACMDIODR_GD_0									(0x1u<<0)

// MACARPAR Configuration

#define	ETH_MACARPAR_ARPPA									(0xFFFFFFFFu<<0)
#define	ETH_MACARPAR_ARPPA_0								(0x1u<<0)

// MACCSRSWCR Configuration

#define	ETH_MACCSRSWCR_SEEN									(0x1u<<8)
#define	ETH_MACCSRSWCR_RCWE									(0x1u<<0)

// MACFPECSR Configuration

#define	ETH_MACFPECSR_TRSP									(0x1u<<19)
#define	ETH_MACFPECSR_TVER									(0x1u<<18)
#define	ETH_MACFPECSR_RRSP									(0x1u<<17)
#define	ETH_MACFPECSR_RVER									(0x1u<<16)
#define	ETH_MACFPECSR_SRSP									(0x1u<<2)
#define	ETH_MACFPECSR_SVER									(0x1u<<1)
#define	ETH_MACFPECSR_EFPE									(0x1u<<0)

