hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
// MACPRSTIMR Configuration

#define	ETH_MACPRSTIMR_MPTN									(0xFFFFFFFFu<<0)
#define	ETH_MACPRSTIMR_MPTN_0								(0x1u<<0)

// MACPRSTIMUR Configuration

#define	ETH_MACPRSTIMUR_MPTU								(0xFFFFFFFFu<<0)
#define	ETH_MACPRSTIMUR_MPTU_0								(0x1u<<0)

// MACA0HR Configuration

#define	ETH_MACA0HR_AE										(0x1u<<31)
#define	ETH_MACA0HR_DCS										(0x1u<<16)
#define	ETH_MACA0HR_ADDRHI									(0xFFFFu<<0)
#define	ETH_MACA0HR_ADDRHI_0								(0x1u<<0)

#define	ETH_MACA0HR_DCS_B_0X0								(0x0u<<16)
#define	ETH_MACA0HR_DCS_B_0X1								(0x1u<<16)

// MACA0LR Configuration

#define	ETH_MACA0LR_ADDRLO									(0xFFFFFFFFu<<0)
#define	ETH_MACA0LR_ADDRLO_0								(0x1u<<0)

// MACA1HR Configuration

#define	ETH_MACA1HR_AE										(0x1u<<31)
#define	ETH_MACA1HR_SA										(0x1u<<30)
#define	ETH_MACA1HR_MBC										(0x3Fu<<24)
#define	ETH_MACA1HR_MBC_0									(0x1u<<24)
#define	ETH_MACA1HR_DCS										(0x1u<<16)
#define	ETH_MACA1HR_ADDRHI									(0xFFFFu<<0)
#define	ETH_MACA1HR_ADDRHI_0								(0x1u<<0)

#define	ETH_MACA1HR_SA_B_0X0								(0x0u<<30)
#define	ETH_MACA1HR_SA_B_0X1								(0x1u<<30)
#define	ETH_MACA1HR_DCS_B_0X0								(0x0u<<16)
#define	ETH_MACA1HR_DCS_B_0X1								(0x1u<<16)

// MACA1LR Configuration

#define	ETH_MACA1LR_ADDRLO									(0xFFFFFFFFu<<0)
#define	ETH_MACA1LR_ADDRLO_0								(0x1u<<0)

// MACA2HR Configuration

#define	ETH_MACA2HR_AE										(0x1u<<31)
#define	ETH_MACA2HR_SA										(0x1u<<30)
#define	ETH_MACA2HR_MBC										(0x3Fu<<24)
#define	ETH_MACA2HR_MBC_0									(0x1u<<24)
#define	ETH_MACA2HR_DCS										(0x1u<<16)
#define	ETH_MACA2HR_ADDRHI									(0xFFFFu<<0)
#define	ETH_MACA2HR_ADDRHI_0								(0x1u<<0)

#define	ETH_MACA2HR_SA_B_0X0								(0x0u<<30)
#define	ETH_MACA2HR_SA_B_0X1								(0x1u<<30)
#define	ETH_MACA2HR_DCS_B_0X0								(0x0u<<16)
#define	ETH_MACA2HR_DCS_B_0X1								(0x1u<<16)

// MACA2LR Configuration

#define	ETH_MACA2LR_ADDRLO									(0xFFFFFFFFu<<0)
#define	ETH_MACA2LR_ADDRLO_0								(0x1u<<0)

// MACA3HR Configuration

#define	ETH_MACA3HR_AE										(0x1u<<31)
#define	ETH_MACA3HR_SA										(0x1u<<30)
#define	ETH_MACA3HR_MBC										(0x3Fu<<24)
#define	ETH_MACA3HR_MBC_0									(0x1u<<24)
#define	ETH_MACA3HR_DCS										(0x1u<<16)
#define	ETH_MACA3HR_ADDRHI									(0xFFFFu<<0)
#define	ETH_MACA3HR_ADDRHI_0								(0x1u<<0)

#define	ETH_MACA3HR_SA_B_0X0								(0x0u<<30)
#define	ETH_MACA3HR_SA_B_0X1								(0x1u<<30)
#define	ETH_MACA3HR_DCS_B_0X0								(0x0u<<16)
#define	ETH_MACA3HR_DCS_B_0X1								(0x1u<<16)

// MACA3LR Configuration

#define	ETH_MACA3LR_ADDRLO									(0xFFFFFFFFu<<0)
#define	ETH_MACA3LR_ADDRLO_0								(0x1u<<0)

// MMC_CONTROL Configuration

#define	ETH_MMC_CONTROL_UCDBC								(0x1u<<8)
#define	ETH_MMC_CONTROL_CNTPRSTLVL							(0x1u<<5)
#define	ETH_MMC_CONTROL_CNTPRST								(0x1u<<4)
#define	ETH_MMC_CONTROL_CNTFREEZ							(0x1u<<3)
#define	ETH_MMC_CONTROL_RSTONRD								(0x1u<<2)
#define	ETH_MMC_CONTROL_CNTSTOPRO							(0x1u<<1)
#define	ETH_MMC_CONTROL_CNTRST								(0x1u<<0)

// MMC_RX_INTERRUPT Configuration

#define	ETH_MMC_RX_INTERRUPT_RXLPITRCIS						(0x1u<<27)
#define	ETH_MMC_RX_INTERRUPT_RXLPIUSCIS						(0x1u<<26)
#define	ETH_MMC_RX_INTERRUPT_RXUCGPIS						(0x1u<<17)
#define	ETH_MMC_RX_INTERRUPT_RXALGNERPIS					(0x1u<<6)
#define	ETH_MMC_RX_INTERRUPT_RXCRCERPIS						(0x1u<<5)

// MMC_TX_INTERRUPT Configuration

#define	ETH_MMC_TX_INTERRUPT_TXLPITRCIS						(0x1u<<27)
#define	ETH_MMC_TX_INTERRUPT_TXLPIUSCIS						(0x1u<<26)
#define	ETH_MMC_TX_INTERRUPT_TXGPKTIS						(0x1u<<21)
#define	ETH_MMC_TX_INTERRUPT_TXMCOLGPIS						(0x1u<<15)
#define	ETH_MMC_TX_INTERRUPT_TXSCOLGPIS						(0x1u<<14)

// MMC_RX_INTERRUPT_MASK Configuration

#define	ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM				(0x1u<<27)
#define	ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM				(0x1u<<26)
#define	ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM					(0x1u<<17)
#define	ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM				(0x1u<<6)
#define	ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM				(0x1u<<5)

// MMC_TX_INTERRUPT_MASK Configuration

#define	ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM				(0x1u<<27)
#define	ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM				(0x1u<<26)
#define	ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM					(0x1u<<21)
#define	ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM				(0x1u<<15)
#define	ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM				(0x1u<<14)

// TX_SINGLE_COLLISION_GOOD_PACKETS Configuration

#define	ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG		(0xFFFFFFFFu<<0)
#define	ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_0	(0x1u<<0)

// TX_MULTIPLE_COLLISION_GOOD_PACKETS Configuration

#define	ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG	(0xFFFFFFFFu<<0)
#define	ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_0	(0x1u<<0)

// TX_PACKET_COUNT_GOOD Configuration

#define	ETH_TX_PACKET_COUNT_GOOD_TXPKTG						(0xFFFFFFFFu<<0)
#define	ETH_TX_PACKET_COUNT_GOOD_TXPKTG_0					(0x1u<<0)

// RX_CRC_ERROR_PACKETS Configuration

#define	ETH_RX_CRC_ERROR_PACKETS_RXCRCERR					(0xFFFFFFFFu<<0)
#define	ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_0					(0x1u<<0)

// RX_ALIGNMENT_ERROR_PACKETS Configuration

#define	ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR			(0xFFFFFFFFu<<0)
#define	ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_0			(0x1u<<0)

// RX_UNICAST_PACKETS_GOOD Configuration

#define	ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG				(0xFFFFFFFFu<<0)
#define	ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_0				(0x1u<<0)

// TX_LPI_USEC_CNTR Configuration

#define	ETH_TX_LPI_USEC_CNTR_TXLPIUSC						(0xFFFFFFFFu<<0)
#define	ETH_TX_LPI_USEC_CNTR_TXLPIUSC_0						(0x1u<<0)

// TX_LPI_TRAN_CNTR Configuration

#define	ETH_TX_LPI_TRAN_CNTR_TXLPITRC						(0xFFFFFFFFu<<0)
#define	ETH_TX_LPI_TRAN_CNTR_TXLPITRC_0						(0x1u<<0)

// RX_LPI_USEC_CNTR Configuration

#define	ETH_RX_LPI_USEC_CNTR_RXLPIUSC						(0xFFFFFFFFu<<0)
#define	ETH_RX_LPI_USEC_CNTR_RXLPIUSC_0						(0x1u<<0)

// RX_LPI_TRAN_CNTR Configuration

#define	ETH_RX_LPI_TRAN_CNTR_RXLPITRC						(0xFFFFFFFFu<<0)
#define	ETH_RX_LPI_TRAN_CNTR_RXLPITRC_0						(0x1u<<0)

// MMC_FPE_TX_ISR Configuration

#define	ETH_MMC_FPE_TX_ISR_HRCIS							(0x1u<<1)
#define	ETH_MMC_FPE_TX_ISR_FCIS								(0x1u<<0)

