hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MACSSIR_SSINC									(0xFFu<<16)
#define	ETH_MACSSIR_SSINC_0									(0x1u<<16)

// MACSTSR Configuration

#define	ETH_MACSTSR_TSS										(0xFFFFFFFFu<<0)
#define	ETH_MACSTSR_TSS_0									(0x1u<<0)

// MACSTNR Configuration

#define	ETH_MACSTNR_TSSS									(0x7FFFFFFFu<<0)
#define	ETH_MACSTNR_TSSS_0									(0x1u<<0)

// MACSTSUR Configuration

#define	ETH_MACSTSUR_TSS									(0xFFFFFFFFu<<0)
#define	ETH_MACSTSUR_TSS_0									(0x1u<<0)

// MACSTNUR Configuration

#define	ETH_MACSTNUR_ADDSUB									(0x1u<<31)
#define	ETH_MACSTNUR_TSSS									(0x7FFFFFFFu<<0)
#define	ETH_MACSTNUR_TSSS_0									(0x1u<<0)

// MACTSAR Configuration

#define	ETH_MACTSAR_TSAR									(0xFFFFFFFFu<<0)
#define	ETH_MACTSAR_TSAR_0									(0x1u<<0)

// MACTSSR Configuration

#define	ETH_MACTSSR_ATSNS									(0x1Fu<<25)
#define	ETH_MACTSSR_ATSNS_0									(0x1u<<25)
#define	ETH_MACTSSR_ATSSTM									(0x1u<<24)
#define	ETH_MACTSSR_ATSSTN									(0xFu<<16)
#define	ETH_MACTSSR_ATSSTN_0								(0x1u<<16)
#define	ETH_MACTSSR_TXTSSIS									(0x1u<<15)
#define	ETH_MACTSSR_TSTRGTERR1								(0x1u<<5)
#define	ETH_MACTSSR_TSTARGT1								(0x1u<<4)
#define	ETH_MACTSSR_TSTRGTERR0								(0x1u<<3)
#define	ETH_MACTSSR_AUXTSTRIG								(0x1u<<2)
#define	ETH_MACTSSR_TSTARGT0								(0x1u<<1)
#define	ETH_MACTSSR_TSSOVF									(0x1u<<0)

// MACTXTSSNR Configuration

#define	ETH_MACTXTSSNR_TXTSSMIS								(0x1u<<31)
#define	ETH_MACTXTSSNR_TXTSSLO								(0x7FFFFFFFu<<0)
#define	ETH_MACTXTSSNR_TXTSSLO_0							(0x1u<<0)

// MACTXTSSSR Configuration

#define	ETH_MACTXTSSSR_TXTSSHI								(0xFFFFFFFFu<<0)
#define	ETH_MACTXTSSSR_TXTSSHI_0							(0x1u<<0)

// MACACR Configuration

#define	ETH_MACACR_ATSEN3									(0x1u<<7)
#define	ETH_MACACR_ATSEN2									(0x1u<<6)
#define	ETH_MACACR_ATSEN1									(0x1u<<5)
#define	ETH_MACACR_ATSEN0									(0x1u<<4)
#define	ETH_MACACR_ATSFC									(0x1u<<0)

// MACATSNR Configuration

#define	ETH_MACATSNR_AUXTSLO								(0x7FFFFFFFu<<0)
#define	ETH_MACATSNR_AUXTSLO_0								(0x1u<<0)

// MACATSSR Configuration

#define	ETH_MACATSSR_AUXTSHI								(0xFFFFFFFFu<<0)
#define	ETH_MACATSSR_AUXTSHI_0								(0x1u<<0)

// MACTSIACR Configuration

#define	ETH_MACTSIACR_OSTIAC								(0xFFFFFFFFu<<0)
#define	ETH_MACTSIACR_OSTIAC_0								(0x1u<<0)

// MACTSEACR Configuration

#define	ETH_MACTSEACR_OSTEAC								(0xFFFFFFFFu<<0)
#define	ETH_MACTSEACR_OSTEAC_0								(0x1u<<0)

// MACTSICNR Configuration

#define	ETH_MACTSICNR_TSIC									(0xFFFFFFFFu<<0)
#define	ETH_MACTSICNR_TSIC_0								(0x1u<<0)

// MACTSECNR Configuration

#define	ETH_MACTSECNR_TSEC									(0xFFFFFFFFu<<0)
#define	ETH_MACTSECNR_TSEC_0								(0x1u<<0)

// MACTSILR Configuration

#define	ETH_MACTSILR_ITLNS									(0xFFFu<<16)
#define	ETH_MACTSILR_ITLNS_0								(0x1u<<16)
#define	ETH_MACTSILR_ITLSNS									(0xFFu<<8)
#define	ETH_MACTSILR_ITLSNS_0								(0x1u<<8)

// MACTSELR Configuration

#define	ETH_MACTSELR_ETLNS									(0xFFFu<<16)
#define	ETH_MACTSELR_ETLNS_0								(0x1u<<16)
#define	ETH_MACTSELR_ETLSNS									(0xFFu<<8)
#define	ETH_MACTSELR_ETLSNS_0								(0x1u<<8)

// MACPPSCR Configuration

#define	ETH_MACPPSCR_TIMESEL								(0x1u<<28)
#define	ETH_MACPPSCR_MCGREN0								(0x1u<<7)
#define	ETH_MACPPSCR_TRGTMODSEL0							(0x3u<<5)
#define	ETH_MACPPSCR_TRGTMODSEL0_0							(0x1u<<5)
#define	ETH_MACPPSCR_PPSEN0									(0x1u<<4)
#define	ETH_MACPPSCR_PPSCTRL								(0xFu<<0)
#define	ETH_MACPPSCR_PPSCTRL_0								(0x1u<<0)

#define	ETH_MACPPSCR_MCGREN0_B_0X0							(0x0u<<7)
#define	ETH_MACPPSCR_MCGREN0_B_0X1							(0x1u<<7)
#define	ETH_MACPPSCR_TRGTMODSEL0_B_0X0						(0x0u<<5)
#define	ETH_MACPPSCR_TRGTMODSEL0_B_0X1						(0x1u<<5)
#define	ETH_MACPPSCR_TRGTMODSEL0_B_0X2						(0x2u<<5)
#define	ETH_MACPPSCR_TRGTMODSEL0_B_0X3						(0x3u<<5)
#define	ETH_MACPPSCR_PPSCTRL_B_0X1							(0x1u<<0)
#define	ETH_MACPPSCR_PPSCTRL_B_0X2							(0x2u<<0)
#define	ETH_MACPPSCR_PPSCTRL_B_0X3							(0x3u<<0)
#define	ETH_MACPPSCR_PPSCTRL_B_0X4							(0x4u<<0)
#define	ETH_MACPPSCR_PPSCTRL_B_0XF							(0xFu<<0)

// MACPPSCR_ALTERNATE Configuration

#define	ETH_MACPPSCR_ALTERNATE_TIMESEL						(0x1u<<28)
#define	ETH_MACPPSCR_ALTERNATE_MCGREN1						(0x1u<<15)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1					(0x3u<<13)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1_0				(0x1u<<13)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD1						(0xFu<<8)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD1_0					(0x1u<<8)
#define	ETH_MACPPSCR_ALTERNATE_MCGREN0						(0x1u<<7)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0					(0x3u<<5)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0_0				(0x1u<<5)
#define	ETH_MACPPSCR_ALTERNATE_PPSEN0						(0x1u<<4)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD						(0xFu<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_0						(0x1u<<0)

#define	ETH_MACPPSCR_ALTERNATE_MCGREN1_B_0X0				(0x0u<<15)
#define	ETH_MACPPSCR_ALTERNATE_MCGREN1_B_0X1				(0x1u<<15)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1_B_0X0			(0x0u<<13)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1_B_0X1			(0x1u<<13)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1_B_0X2			(0x2u<<13)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL1_B_0X3			(0x3u<<13)
#define	ETH_MACPPSCR_ALTERNATE_MCGREN0_B_0X0				(0x0u<<7)
#define	ETH_MACPPSCR_ALTERNATE_MCGREN0_B_0X1				(0x1u<<7)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0_B_0X0			(0x0u<<5)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0_B_0X1			(0x1u<<5)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0_B_0X2			(0x2u<<5)
#define	ETH_MACPPSCR_ALTERNATE_TRGTMODSEL0_B_0X3			(0x3u<<5)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X0					(0x0u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X1					(0x1u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X2					(0x2u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X3					(0x3u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X4					(0x4u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X5					(0x5u<<0)
#define	ETH_MACPPSCR_ALTERNATE_PPSCMD_B_0X6					(0x6u<<0)

// MACPPSTTS0R Configuration

#define	ETH_MACPPSTTS0R_TSTRH0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSTTS0R_TSTRH0_0							(0x1u<<0)

// MACPPSTTN0R Configuration

#define	ETH_MACPPSTTN0R_TRGTBUSY0							(0x1u<<31)
#define	ETH_MACPPSTTN0R_TTSL0								(0x7FFFFFFFu<<0)
#define	ETH_MACPPSTTN0R_TTSL0_0								(0x1u<<0)

// MACPPSI0R Configuration

