hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MACPPSI0R_PPSINT0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSI0R_PPSINT0_0								(0x1u<<0)

// MACPPSW0R Configuration

#define	ETH_MACPPSW0R_PPSWIDTH0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSW0R_PPSWIDTH0_0							(0x1u<<0)

// MACPPSTTS1R Configuration

#define	ETH_MACPPSTTS1R_TSTRH0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSTTS1R_TSTRH0_0							(0x1u<<0)

// MACPPSTTN1R Configuration

#define	ETH_MACPPSTTN1R_TRGTBUSY0							(0x1u<<31)
#define	ETH_MACPPSTTN1R_TTSL0								(0x7FFFFFFFu<<0)
#define	ETH_MACPPSTTN1R_TTSL0_0								(0x1u<<0)

// MACPPSI1R Configuration

#define	ETH_MACPPSI1R_PPSINT0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSI1R_PPSINT0_0								(0x1u<<0)

// MACPPSW1R Configuration

#define	ETH_MACPPSW1R_PPSWIDTH0								(0xFFFFFFFFu<<0)
#define	ETH_MACPPSW1R_PPSWIDTH0_0							(0x1u<<0)

// MACPOCR Configuration

#define	ETH_MACPOCR_DN										(0xFFu<<8)
#define	ETH_MACPOCR_DN_0									(0x1u<<8)
#define	ETH_MACPOCR_PDRDIS									(0x1u<<7)
#define	ETH_MACPOCR_DRRDIS									(0x1u<<6)
#define	ETH_MACPOCR_APDREQTRIG								(0x1u<<5)
#define	ETH_MACPOCR_ASYNCTRIG								(0x1u<<4)
#define	ETH_MACPOCR_APDREQEN								(0x1u<<2)
#define	ETH_MACPOCR_ASYNCEN									(0x1u<<1)
#define	ETH_MACPOCR_PTOEN									(0x1u<<0)

// MACSPI0R Configuration

#define	ETH_MACSPI0R_SPI0									(0xFFFFFFFFu<<0)
#define	ETH_MACSPI0R_SPI0_0									(0x1u<<0)

// MACSPI1R Configuration

#define	ETH_MACSPI1R_SPI1									(0xFFFFFFFFu<<0)
#define	ETH_MACSPI1R_SPI1_0									(0x1u<<0)

// MACSPI2R Configuration

#define	ETH_MACSPI2R_SPI2									(0xFFFFu<<0)
#define	ETH_MACSPI2R_SPI2_0									(0x1u<<0)

// MACLMIR Configuration

#define	ETH_MACLMIR_LMPDRI									(0xFFu<<24)
#define	ETH_MACLMIR_LMPDRI_0								(0x1u<<24)
#define	ETH_MACLMIR_DRSYNCR									(0x7u<<8)
#define	ETH_MACLMIR_DRSYNCR_0								(0x1u<<8)
#define	ETH_MACLMIR_LSI										(0xFFu<<0)
#define	ETH_MACLMIR_LSI_0									(0x1u<<0)

#define	ETH_MACLMIR_DRSYNCR_B_0X0							(0x0u<<8)
#define	ETH_MACLMIR_DRSYNCR_B_0X1							(0x1u<<8)

// MTLOMR Configuration

#define	ETH_MTLOMR_CNTCLR									(0x1u<<9)
#define	ETH_MTLOMR_CNTPRST									(0x1u<<8)
#define	ETH_MTLOMR_SCHALG									(0x3u<<5)
#define	ETH_MTLOMR_SCHALG_0									(0x1u<<5)
#define	ETH_MTLOMR_RAA										(0x1u<<2)
#define	ETH_MTLOMR_DTXSTS									(0x1u<<1)

#define	ETH_MTLOMR_SCHALG_B_0X0								(0x0u<<5)
#define	ETH_MTLOMR_SCHALG_B_0X3								(0x3u<<5)
#define	ETH_MTLOMR_RAA_B_0X0								(0x0u<<2)
#define	ETH_MTLOMR_RAA_B_0X1								(0x1u<<2)

// MTLISR Configuration

#define	ETH_MTLISR_ESTIS									(0x1u<<18)
#define	ETH_MTLISR_Q1IS										(0x1u<<1)
#define	ETH_MTLISR_Q0IS										(0x1u<<0)

// MTLRXQDMAMR Configuration

#define	ETH_MTLRXQDMAMR_Q1DDMACH							(0x1u<<12)
#define	ETH_MTLRXQDMAMR_Q1MDMACH							(0x1u<<8)
#define	ETH_MTLRXQDMAMR_Q0DDMACH							(0x1u<<4)
#define	ETH_MTLRXQDMAMR_Q0MDMACH							(0x1u<<0)

#define	ETH_MTLRXQDMAMR_Q1MDMACH_B_0X0						(0x0u<<8)
#define	ETH_MTLRXQDMAMR_Q1MDMACH_B_0X1						(0x1u<<8)
#define	ETH_MTLRXQDMAMR_Q0MDMACH_B_0X0						(0x0u<<0)
#define	ETH_MTLRXQDMAMR_Q0MDMACH_B_0X1						(0x1u<<0)

// MTLTBSCR Configuration

#define	ETH_MTLTBSCR_LEOS									(0xFFFFFFu<<8)
#define	ETH_MTLTBSCR_LEOS_0									(0x1u<<8)
#define	ETH_MTLTBSCR_LEGOS									(0x7u<<4)
#define	ETH_MTLTBSCR_LEGOS_0								(0x1u<<4)
#define	ETH_MTLTBSCR_LEOV									(0x1u<<1)
#define	ETH_MTLTBSCR_ESTM									(0x1u<<0)

#define	ETH_MTLTBSCR_LEOV_B_0X0								(0x0u<<1)
#define	ETH_MTLTBSCR_LEOV_B_0X1								(0x1u<<1)
#define	ETH_MTLTBSCR_ESTM_B_0X0								(0x0u<<0)
#define	ETH_MTLTBSCR_ESTM_B_0X1								(0x1u<<0)

// MTLESTCR Configuration

#define	ETH_MTLESTCR_PTOV									(0xFFu<<24)
#define	ETH_MTLESTCR_PTOV_0									(0x1u<<24)
#define	ETH_MTLESTCR_CTOV									(0xFFFu<<12)
#define	ETH_MTLESTCR_CTOV_0									(0x1u<<12)
#define	ETH_MTLESTCR_TILS									(0x7u<<8)
#define	ETH_MTLESTCR_TILS_0									(0x1u<<8)
#define	ETH_MTLESTCR_LCSE									(0x3u<<6)
#define	ETH_MTLESTCR_LCSE_0									(0x1u<<6)
#define	ETH_MTLESTCR_DFBS									(0x1u<<5)
#define	ETH_MTLESTCR_DDBF									(0x1u<<4)
#define	ETH_MTLESTCR_SSWL									(0x1u<<1)
#define	ETH_MTLESTCR_EEST									(0x1u<<0)

#define	ETH_MTLESTCR_TILS_B_0X0								(0x0u<<8)
#define	ETH_MTLESTCR_TILS_B_0X1								(0x1u<<8)
#define	ETH_MTLESTCR_TILS_B_0X2								(0x2u<<8)
#define	ETH_MTLESTCR_TILS_B_0X4								(0x4u<<8)
#define	ETH_MTLESTCR_LCSE_B_0X0								(0x0u<<6)
#define	ETH_MTLESTCR_LCSE_B_0X1								(0x1u<<6)
#define	ETH_MTLESTCR_LCSE_B_0X2								(0x2u<<6)
#define	ETH_MTLESTCR_LCSE_B_0X3								(0x3u<<6)
#define	ETH_MTLESTCR_DFBS_B_0X0								(0x0u<<5)
#define	ETH_MTLESTCR_DFBS_B_0X1								(0x1u<<5)
#define	ETH_MTLESTCR_DDBF_B_0X0								(0x0u<<4)
#define	ETH_MTLESTCR_DDBF_B_0X1								(0x1u<<4)
#define	ETH_MTLESTCR_EEST_B_0X0								(0x0u<<0)
#define	ETH_MTLESTCR_EEST_B_0X1								(0x1u<<0)

// MTLESTECR Configuration

#define	ETH_MTLESTECR_OVHD									(0x3Fu<<0)
#define	ETH_MTLESTECR_OVHD_0								(0x1u<<0)

// MTLESTSR Configuration

#define	ETH_MTLESTSR_CGSN									(0xFu<<16)
#define	ETH_MTLESTSR_CGSN_0									(0x1u<<16)
#define	ETH_MTLESTSR_BTRL									(0xFFu<<8)
#define	ETH_MTLESTSR_BTRL_0									(0x1u<<8)
#define	ETH_MTLESTSR_SWOL									(0x1u<<7)
#define	ETH_MTLESTSR_CGCE									(0x1u<<4)
#define	ETH_MTLESTSR_HLBS									(0x1u<<3)
#define	ETH_MTLESTSR_HLBF									(0x1u<<2)
#define	ETH_MTLESTSR_BTRE									(0x1u<<1)
#define	ETH_MTLESTSR_SWLC									(0x1u<<0)

#define	ETH_MTLESTSR_SWOL_B_0X0								(0x0u<<7)
#define	ETH_MTLESTSR_SWOL_B_0X1								(0x1u<<7)
#define	ETH_MTLESTSR_CGCE_B_0X0								(0x0u<<4)
#define	ETH_MTLESTSR_CGCE_B_0X1								(0x1u<<4)
#define	ETH_MTLESTSR_HLBS_B_0X0								(0x0u<<3)
#define	ETH_MTLESTSR_HLBS_B_0X1								(0x1u<<3)
#define	ETH_MTLESTSR_BTRE_B_0X0								(0x0u<<1)
#define	ETH_MTLESTSR_BTRE_B_0X1								(0x1u<<1)
#define	ETH_MTLESTSR_SWLC_B_0X0								(0x0u<<0)
#define	ETH_MTLESTSR_SWLC_B_0X1								(0x1u<<0)

// MTLESTSCHER Configuration

#define	ETH_MTLESTSCHER_SEQN								(0x3u<<0)
#define	ETH_MTLESTSCHER_SEQN_0								(0x1u<<0)

// MTLESTFSER Configuration

#define	ETH_MTLESTFSER_FEQN									(0x3u<<0)
#define	ETH_MTLESTFSER_FEQN_0								(0x1u<<0)

// MTLESTFSCR Configuration

