hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MTLESTFSCR_HBFQ									(0x1u<<16)
#define	ETH_MTLESTFSCR_HBFS									(0x7FFFu<<0)
#define	ETH_MTLESTFSCR_HBFS_0								(0x1u<<0)

// MTLESTIER Configuration

#define	ETH_MTLESTIER_CGCE									(0x1u<<4)
#define	ETH_MTLESTIER_IEHS									(0x1u<<3)
#define	ETH_MTLESTIER_IEHF									(0x1u<<2)
#define	ETH_MTLESTIER_IEBE									(0x1u<<1)
#define	ETH_MTLESTIER_IECC									(0x1u<<0)

// MTLESTGCLCR Configuration

#define	ETH_MTLESTGCLCR_ADDR								(0x3Fu<<8)
#define	ETH_MTLESTGCLCR_ADDR_0								(0x1u<<8)
#define	ETH_MTLESTGCLCR_DBGB								(0x1u<<5)
#define	ETH_MTLESTGCLCR_DBGM								(0x1u<<4)
#define	ETH_MTLESTGCLCR_GCRR								(0x1u<<2)
#define	ETH_MTLESTGCLCR_R1W0								(0x1u<<1)
#define	ETH_MTLESTGCLCR_SRWO								(0x1u<<0)

#define	ETH_MTLESTGCLCR_ADDR_B_0X0_GCRR__EQUAL_1			(0x0u<<8)
#define	ETH_MTLESTGCLCR_ADDR_B_0X1_GCRR__EQUAL_1			(0x1u<<8)
#define	ETH_MTLESTGCLCR_ADDR_B_0X2_GCRR__EQUAL_1			(0x2u<<8)
#define	ETH_MTLESTGCLCR_ADDR_B_0X3_GCRR__EQUAL_1			(0x3u<<8)
#define	ETH_MTLESTGCLCR_ADDR_B_0X4_GCRR__EQUAL_1			(0x4u<<8)
#define	ETH_MTLESTGCLCR_ADDR_B_0X5_GCRR__EQUAL_1			(0x5u<<8)
#define	ETH_MTLESTGCLCR_DBGB_B_0X0							(0x0u<<5)
#define	ETH_MTLESTGCLCR_DBGB_B_0X1							(0x1u<<5)
#define	ETH_MTLESTGCLCR_R1W0_B_0X1							(0x1u<<1)
#define	ETH_MTLESTGCLCR_R1W0_B_0X0							(0x0u<<1)
#define	ETH_MTLESTGCLCR_SRWO_B_0X1							(0x1u<<0)

// MTLESTGCLDR Configuration

#define	ETH_MTLESTGCLDR_GCD									(0xFFFFFFFFu<<0)
#define	ETH_MTLESTGCLDR_GCD_0								(0x1u<<0)

// MTLFPECSR Configuration

#define	ETH_MTLFPECSR_HRS									(0x1u<<28)
#define	ETH_MTLFPECSR_PEC									(0x3u<<8)
#define	ETH_MTLFPECSR_PEC_0									(0x1u<<8)
#define	ETH_MTLFPECSR_AFSZ									(0x3u<<0)
#define	ETH_MTLFPECSR_AFSZ_0								(0x1u<<0)

#define	ETH_MTLFPECSR_HRS_B_0X1								(0x1u<<28)
#define	ETH_MTLFPECSR_HRS_B_0X0								(0x0u<<28)

// MTLFPEAR Configuration

#define	ETH_MTLFPEAR_RADV									(0xFFFFu<<16)
#define	ETH_MTLFPEAR_RADV_0									(0x1u<<16)
#define	ETH_MTLFPEAR_HADV									(0xFFFFu<<0)
#define	ETH_MTLFPEAR_HADV_0									(0x1u<<0)

// MTLTXQ0OMR Configuration

#define	ETH_MTLTXQ0OMR_TQS									(0xFu<<16)
#define	ETH_MTLTXQ0OMR_TQS_0								(0x1u<<16)
#define	ETH_MTLTXQ0OMR_TTC									(0x7u<<4)
#define	ETH_MTLTXQ0OMR_TTC_0								(0x1u<<4)
#define	ETH_MTLTXQ0OMR_TXQEN								(0x3u<<2)
#define	ETH_MTLTXQ0OMR_TXQEN_0								(0x1u<<2)
#define	ETH_MTLTXQ0OMR_TSF									(0x1u<<1)
#define	ETH_MTLTXQ0OMR_FTQ									(0x1u<<0)

#define	ETH_MTLTXQ0OMR_TTC_B_0X0							(0x0u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X1							(0x1u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X2							(0x2u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X3							(0x3u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X4							(0x4u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X5							(0x5u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X6							(0x6u<<4)
#define	ETH_MTLTXQ0OMR_TTC_B_0X7							(0x7u<<4)
#define	ETH_MTLTXQ0OMR_TXQEN_B_0X0							(0x0u<<2)
#define	ETH_MTLTXQ0OMR_TXQEN_B_0X1							(0x1u<<2)
#define	ETH_MTLTXQ0OMR_TXQEN_B_0X2							(0x2u<<2)

// MTLTXQ0UR Configuration

#define	ETH_MTLTXQ0UR_UFCNTOVF								(0x1u<<11)
#define	ETH_MTLTXQ0UR_UFFRMCNT								(0x7FFu<<0)
#define	ETH_MTLTXQ0UR_UFFRMCNT_0							(0x1u<<0)

// MTLTXQ0DR Configuration

#define	ETH_MTLTXQ0DR_STXSTSF								(0x7u<<20)
#define	ETH_MTLTXQ0DR_STXSTSF_0								(0x1u<<20)
#define	ETH_MTLTXQ0DR_PTXQ									(0x7u<<16)
#define	ETH_MTLTXQ0DR_PTXQ_0								(0x1u<<16)
#define	ETH_MTLTXQ0DR_TXSTSFSTS								(0x1u<<5)
#define	ETH_MTLTXQ0DR_TXQSTS								(0x1u<<4)
#define	ETH_MTLTXQ0DR_TWCSTS								(0x1u<<3)
#define	ETH_MTLTXQ0DR_TRCSTS								(0x3u<<1)
#define	ETH_MTLTXQ0DR_TRCSTS_0								(0x1u<<1)
#define	ETH_MTLTXQ0DR_TXQPAUSED								(0x1u<<0)

#define	ETH_MTLTXQ0DR_TRCSTS_B_0X0							(0x0u<<1)
#define	ETH_MTLTXQ0DR_TRCSTS_B_0X1							(0x1u<<1)
#define	ETH_MTLTXQ0DR_TRCSTS_B_0X2							(0x2u<<1)
#define	ETH_MTLTXQ0DR_TRCSTS_B_0X3							(0x3u<<1)

// MTLTXQ0ESR Configuration

#define	ETH_MTLTXQ0ESR_ABS									(0xFFFFFFu<<0)
#define	ETH_MTLTXQ0ESR_ABS_0								(0x1u<<0)

// MTLTXQ0QWR Configuration

#define	ETH_MTLTXQ0QWR_ISCQW								(0x7Fu<<0)
#define	ETH_MTLTXQ0QWR_ISCQW_0								(0x1u<<0)

// MTLQ0ICSR Configuration

#define	ETH_MTLQ0ICSR_RXOIE									(0x1u<<24)
#define	ETH_MTLQ0ICSR_RXOVFIS								(0x1u<<16)
#define	ETH_MTLQ0ICSR_ABPSIE								(0x1u<<9)
#define	ETH_MTLQ0ICSR_TXUIE									(0x1u<<8)
#define	ETH_MTLQ0ICSR_ABPSIS								(0x1u<<1)
#define	ETH_MTLQ0ICSR_TXUNFIS								(0x1u<<0)

// MTLRXQ0OMR Configuration

#define	ETH_MTLRXQ0OMR_RQS									(0xFu<<20)
#define	ETH_MTLRXQ0OMR_RQS_0								(0x1u<<20)
#define	ETH_MTLRXQ0OMR_RFD									(0x7u<<14)
#define	ETH_MTLRXQ0OMR_RFD_0								(0x1u<<14)
#define	ETH_MTLRXQ0OMR_RFA									(0x7u<<8)
#define	ETH_MTLRXQ0OMR_RFA_0								(0x1u<<8)
#define	ETH_MTLRXQ0OMR_EHFC									(0x1u<<7)
#define	ETH_MTLRXQ0OMR_DIS_TCP_EF							(0x1u<<6)
#define	ETH_MTLRXQ0OMR_RSF									(0x1u<<5)
#define	ETH_MTLRXQ0OMR_FEP									(0x1u<<4)
#define	ETH_MTLRXQ0OMR_FUP									(0x1u<<3)
#define	ETH_MTLRXQ0OMR_RTC									(0x3u<<0)
#define	ETH_MTLRXQ0OMR_RTC_0								(0x1u<<0)

#define	ETH_MTLRXQ0OMR_RFD_B_0X0							(0x0u<<14)
#define	ETH_MTLRXQ0OMR_RFD_B_0X1							(0x1u<<14)
#define	ETH_MTLRXQ0OMR_RTC_B_0X0							(0x0u<<0)
#define	ETH_MTLRXQ0OMR_RTC_B_0X1							(0x1u<<0)
#define	ETH_MTLRXQ0OMR_RTC_B_0X2							(0x2u<<0)
#define	ETH_MTLRXQ0OMR_RTC_B_0X3							(0x3u<<0)

// MTLRXQ0MPOCR Configuration

#define	ETH_MTLRXQ0MPOCR_MISCNTOVF							(0x1u<<27)
#define	ETH_MTLRXQ0MPOCR_MISPKTCNT							(0x7FFu<<16)
#define	ETH_MTLRXQ0MPOCR_MISPKTCNT_0						(0x1u<<16)
#define	ETH_MTLRXQ0MPOCR_OVFCNTOVF							(0x1u<<11)
#define	ETH_MTLRXQ0MPOCR_OVFPKTCNT							(0x7FFu<<0)
#define	ETH_MTLRXQ0MPOCR_OVFPKTCNT_0						(0x1u<<0)

// MTLRXQ0DR Configuration

#define	ETH_MTLRXQ0DR_PRXQ									(0x3FFFu<<16)
#define	ETH_MTLRXQ0DR_PRXQ_0								(0x1u<<16)
#define	ETH_MTLRXQ0DR_RXQSTS								(0x3u<<4)
#define	ETH_MTLRXQ0DR_RXQSTS_0								(0x1u<<4)
#define	ETH_MTLRXQ0DR_RRCSTS								(0x3u<<1)
#define	ETH_MTLRXQ0DR_RRCSTS_0								(0x1u<<1)
#define	ETH_MTLRXQ0DR_RWCSTS								(0x1u<<0)

#define	ETH_MTLRXQ0DR_RXQSTS_B_0X0							(0x0u<<4)
#define	ETH_MTLRXQ0DR_RXQSTS_B_0X1							(0x1u<<4)
#define	ETH_MTLRXQ0DR_RXQSTS_B_0X2							(0x2u<<4)
#define	ETH_MTLRXQ0DR_RXQSTS_B_0X3							(0x3u<<4)
#define	ETH_MTLRXQ0DR_RRCSTS_B_0X0							(0x0u<<1)
#define	ETH_MTLRXQ0DR_RRCSTS_B_0X1							(0x1u<<1)
#define	ETH_MTLRXQ0DR_RRCSTS_B_0X2							(0x2u<<1)
#define	ETH_MTLRXQ0DR_RRCSTS_B_0X3							(0x3u<<1)

// MTLRXQ0CR Configuration

