hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
#define	ETH_MTLRXQ0CR_RXQ_FRM_ARBIT							(0x1u<<3)
#define	ETH_MTLRXQ0CR_RXQ_WEGT								(0x7u<<0)
#define	ETH_MTLRXQ0CR_RXQ_WEGT_0							(0x1u<<0)

// MTLTXQ1OMR Configuration

#define	ETH_MTLTXQ1OMR_TQS									(0xFu<<16)
#define	ETH_MTLTXQ1OMR_TQS_0								(0x1u<<16)
#define	ETH_MTLTXQ1OMR_TTC									(0x7u<<4)
#define	ETH_MTLTXQ1OMR_TTC_0								(0x1u<<4)
#define	ETH_MTLTXQ1OMR_TXQEN								(0x3u<<2)
#define	ETH_MTLTXQ1OMR_TXQEN_0								(0x1u<<2)
#define	ETH_MTLTXQ1OMR_TSF									(0x1u<<1)
#define	ETH_MTLTXQ1OMR_FTQ									(0x1u<<0)

#define	ETH_MTLTXQ1OMR_TTC_B_0X0							(0x0u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X1							(0x1u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X2							(0x2u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X3							(0x3u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X4							(0x4u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X5							(0x5u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X6							(0x6u<<4)
#define	ETH_MTLTXQ1OMR_TTC_B_0X7							(0x7u<<4)
#define	ETH_MTLTXQ1OMR_TXQEN_B_0X0							(0x0u<<2)
#define	ETH_MTLTXQ1OMR_TXQEN_B_0X1							(0x1u<<2)
#define	ETH_MTLTXQ1OMR_TXQEN_B_0X2							(0x2u<<2)

// MTLTXQ1UR Configuration

#define	ETH_MTLTXQ1UR_UFCNTOVF								(0x1u<<11)
#define	ETH_MTLTXQ1UR_UFFRMCNT								(0x7FFu<<0)
#define	ETH_MTLTXQ1UR_UFFRMCNT_0							(0x1u<<0)

// MTLTXQ1DR Configuration

#define	ETH_MTLTXQ1DR_STXSTSF								(0x7u<<20)
#define	ETH_MTLTXQ1DR_STXSTSF_0								(0x1u<<20)
#define	ETH_MTLTXQ1DR_PTXQ									(0x7u<<16)
#define	ETH_MTLTXQ1DR_PTXQ_0								(0x1u<<16)
#define	ETH_MTLTXQ1DR_TXSTSFSTS								(0x1u<<5)
#define	ETH_MTLTXQ1DR_TXQSTS								(0x1u<<4)
#define	ETH_MTLTXQ1DR_TWCSTS								(0x1u<<3)
#define	ETH_MTLTXQ1DR_TRCSTS								(0x3u<<1)
#define	ETH_MTLTXQ1DR_TRCSTS_0								(0x1u<<1)
#define	ETH_MTLTXQ1DR_TXQPAUSED								(0x1u<<0)

#define	ETH_MTLTXQ1DR_TRCSTS_B_0X0							(0x0u<<1)
#define	ETH_MTLTXQ1DR_TRCSTS_B_0X1							(0x1u<<1)
#define	ETH_MTLTXQ1DR_TRCSTS_B_0X2							(0x2u<<1)
#define	ETH_MTLTXQ1DR_TRCSTS_B_0X3							(0x3u<<1)

// MTLTXQ1ECR Configuration

#define	ETH_MTLTXQ1ECR_SLC									(0x7u<<4)
#define	ETH_MTLTXQ1ECR_SLC_0								(0x1u<<4)
#define	ETH_MTLTXQ1ECR_CC									(0x1u<<3)
#define	ETH_MTLTXQ1ECR_AVALG								(0x1u<<2)

#define	ETH_MTLTXQ1ECR_SLC_B_0X0							(0x0u<<4)
#define	ETH_MTLTXQ1ECR_SLC_B_0X1							(0x1u<<4)
#define	ETH_MTLTXQ1ECR_SLC_B_0X2							(0x2u<<4)
#define	ETH_MTLTXQ1ECR_SLC_B_0X3							(0x3u<<4)
#define	ETH_MTLTXQ1ECR_SLC_B_0X4							(0x4u<<4)

// MTLTXQ1ESR Configuration

#define	ETH_MTLTXQ1ESR_ABS									(0xFFFFFFu<<0)
#define	ETH_MTLTXQ1ESR_ABS_0								(0x1u<<0)

// MTLTXQ1QWR Configuration

#define	ETH_MTLTXQ1QWR_ISCQW								(0x3FFFu<<0)
#define	ETH_MTLTXQ1QWR_ISCQW_0								(0x1u<<0)

// MTLTXQ1SSCR Configuration

#define	ETH_MTLTXQ1SSCR_SSC									(0x3FFFu<<0)
#define	ETH_MTLTXQ1SSCR_SSC_0								(0x1u<<0)

// MTLTXQ1HCR Configuration

#define	ETH_MTLTXQ1HCR_HC									(0x1FFFFFFFu<<0)
#define	ETH_MTLTXQ1HCR_HC_0									(0x1u<<0)

// MTLTXQ1LCR Configuration

#define	ETH_MTLTXQ1LCR_LC									(0x1FFFFFFFu<<0)
#define	ETH_MTLTXQ1LCR_LC_0									(0x1u<<0)

// MTLQ1ICSR Configuration

#define	ETH_MTLQ1ICSR_RXOIE									(0x1u<<24)
#define	ETH_MTLQ1ICSR_RXOVFIS								(0x1u<<16)
#define	ETH_MTLQ1ICSR_ABPSIE								(0x1u<<9)
#define	ETH_MTLQ1ICSR_TXUIE									(0x1u<<8)
#define	ETH_MTLQ1ICSR_ABPSIS								(0x1u<<1)
#define	ETH_MTLQ1ICSR_TXUNFIS								(0x1u<<0)

// MTLRXQ1OMR Configuration

#define	ETH_MTLRXQ1OMR_RQS									(0xFu<<20)
#define	ETH_MTLRXQ1OMR_RQS_0								(0x1u<<20)
#define	ETH_MTLRXQ1OMR_RFD									(0x7u<<14)
#define	ETH_MTLRXQ1OMR_RFD_0								(0x1u<<14)
#define	ETH_MTLRXQ1OMR_RFA									(0x7u<<8)
#define	ETH_MTLRXQ1OMR_RFA_0								(0x1u<<8)
#define	ETH_MTLRXQ1OMR_EHFC									(0x1u<<7)
#define	ETH_MTLRXQ1OMR_DIS_TCP_EF							(0x1u<<6)
#define	ETH_MTLRXQ1OMR_RSF									(0x1u<<5)
#define	ETH_MTLRXQ1OMR_FEP									(0x1u<<4)
#define	ETH_MTLRXQ1OMR_FUP									(0x1u<<3)
#define	ETH_MTLRXQ1OMR_RTC									(0x3u<<0)
#define	ETH_MTLRXQ1OMR_RTC_0								(0x1u<<0)

#define	ETH_MTLRXQ1OMR_RFD_B_0X0							(0x0u<<14)
#define	ETH_MTLRXQ1OMR_RFD_B_0X1							(0x1u<<14)
#define	ETH_MTLRXQ1OMR_RTC_B_0X0							(0x0u<<0)
#define	ETH_MTLRXQ1OMR_RTC_B_0X1							(0x1u<<0)
#define	ETH_MTLRXQ1OMR_RTC_B_0X2							(0x2u<<0)
#define	ETH_MTLRXQ1OMR_RTC_B_0X3							(0x3u<<0)

// MTLRXQ1MPOCR Configuration

#define	ETH_MTLRXQ1MPOCR_MISCNTOVF							(0x1u<<27)
#define	ETH_MTLRXQ1MPOCR_MISPKTCNT							(0x7FFu<<16)
#define	ETH_MTLRXQ1MPOCR_MISPKTCNT_0						(0x1u<<16)
#define	ETH_MTLRXQ1MPOCR_OVFCNTOVF							(0x1u<<11)
#define	ETH_MTLRXQ1MPOCR_OVFPKTCNT							(0x7FFu<<0)
#define	ETH_MTLRXQ1MPOCR_OVFPKTCNT_0						(0x1u<<0)

// MTLRXQ1DR Configuration

#define	ETH_MTLRXQ1DR_PRXQ									(0x3FFFu<<16)
#define	ETH_MTLRXQ1DR_PRXQ_0								(0x1u<<16)
#define	ETH_MTLRXQ1DR_RXQSTS								(0x3u<<4)
#define	ETH_MTLRXQ1DR_RXQSTS_0								(0x1u<<4)
#define	ETH_MTLRXQ1DR_RRCSTS								(0x3u<<1)
#define	ETH_MTLRXQ1DR_RRCSTS_0								(0x1u<<1)
#define	ETH_MTLRXQ1DR_RWCSTS								(0x1u<<0)

#define	ETH_MTLRXQ1DR_RXQSTS_B_0X0							(0x0u<<4)
#define	ETH_MTLRXQ1DR_RXQSTS_B_0X1							(0x1u<<4)
#define	ETH_MTLRXQ1DR_RXQSTS_B_0X2							(0x2u<<4)
#define	ETH_MTLRXQ1DR_RXQSTS_B_0X3							(0x3u<<4)
#define	ETH_MTLRXQ1DR_RRCSTS_B_0X0							(0x0u<<1)
#define	ETH_MTLRXQ1DR_RRCSTS_B_0X1							(0x1u<<1)
#define	ETH_MTLRXQ1DR_RRCSTS_B_0X2							(0x2u<<1)
#define	ETH_MTLRXQ1DR_RRCSTS_B_0X3							(0x3u<<1)

// MTLRXQ1CR Configuration

#define	ETH_MTLRXQ1CR_RXQ_FRM_ARBIT							(0x1u<<3)
#define	ETH_MTLRXQ1CR_RXQ_WEGT								(0x7u<<0)
#define	ETH_MTLRXQ1CR_RXQ_WEGT_0							(0x1u<<0)

// DMAMR Configuration

#define	ETH_DMAMR_INTM										(0x3u<<16)
#define	ETH_DMAMR_INTM_0									(0x1u<<16)
#define	ETH_DMAMR_TXPR										(0x1u<<11)
#define	ETH_DMAMR_DSPW										(0x1u<<8)
#define	ETH_DMAMR_TAA										(0x7u<<2)
#define	ETH_DMAMR_TAA_0										(0x1u<<2)
#define	ETH_DMAMR_SWR										(0x1u<<0)

#define	ETH_DMAMR_DSPW_B_0X0								(0x0u<<8)
#define	ETH_DMAMR_DSPW_B_0X1								(0x1u<<8)
#define	ETH_DMAMR_TAA_B_0X0									(0x0u<<2)
#define	ETH_DMAMR_TAA_B_0X1									(0x1u<<2)
#define	ETH_DMAMR_TAA_B_0X2									(0x2u<<2)

