hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
// DMASBMR Configuration

#define	ETH_DMASBMR_EN_LPI									(0x1u<<31)
#define	ETH_DMASBMR_LPI_XIT_PKT								(0x1u<<30)
#define	ETH_DMASBMR_WR_OSR_LMT								(0x3u<<24)
#define	ETH_DMASBMR_WR_OSR_LMT_0							(0x1u<<24)
#define	ETH_DMASBMR_RD_OSR_LMT								(0x3u<<16)
#define	ETH_DMASBMR_RD_OSR_LMT_0							(0x1u<<16)
#define	ETH_DMASBMR_ONEKBBE									(0x1u<<13)
#define	ETH_DMASBMR_AAL										(0x1u<<12)
#define	ETH_DMASBMR_AALE									(0x1u<<10)
#define	ETH_DMASBMR_BLEN256									(0x1u<<7)
#define	ETH_DMASBMR_BLEN128									(0x1u<<6)
#define	ETH_DMASBMR_BLEN64									(0x1u<<5)
#define	ETH_DMASBMR_BLEN32									(0x1u<<4)
#define	ETH_DMASBMR_BLEN16									(0x1u<<3)
#define	ETH_DMASBMR_BLEN8									(0x1u<<2)
#define	ETH_DMASBMR_BLEN4									(0x1u<<1)
#define	ETH_DMASBMR_FB										(0x1u<<0)

// DMAISR Configuration

#define	ETH_DMAISR_MACIS									(0x1u<<17)
#define	ETH_DMAISR_MTLIS									(0x1u<<16)
#define	ETH_DMAISR_DC1IS									(0x1u<<1)
#define	ETH_DMAISR_DC0IS									(0x1u<<0)

// DMADSR Configuration

#define	ETH_DMADSR_TPS1										(0xFu<<20)
#define	ETH_DMADSR_TPS1_0									(0x1u<<20)
#define	ETH_DMADSR_RPS1										(0xFu<<16)
#define	ETH_DMADSR_RPS1_0									(0x1u<<16)
#define	ETH_DMADSR_TPS0										(0xFu<<12)
#define	ETH_DMADSR_TPS0_0									(0x1u<<12)
#define	ETH_DMADSR_RPS0										(0xFu<<8)
#define	ETH_DMADSR_RPS0_0									(0x1u<<8)
#define	ETH_DMADSR_AXRHSTS									(0x1u<<1)
#define	ETH_DMADSR_AXWHSTS									(0x1u<<0)

#define	ETH_DMADSR_TPS0_B_0X0								(0x0u<<12)
#define	ETH_DMADSR_TPS0_B_0X1								(0x1u<<12)
#define	ETH_DMADSR_TPS0_B_0X2								(0x2u<<12)
#define	ETH_DMADSR_TPS0_B_0X3								(0x3u<<12)
#define	ETH_DMADSR_TPS0_B_0X4								(0x4u<<12)
#define	ETH_DMADSR_TPS0_B_0X6								(0x6u<<12)
#define	ETH_DMADSR_TPS0_B_0X7								(0x7u<<12)
#define	ETH_DMADSR_RPS0_B_0X0								(0x0u<<8)
#define	ETH_DMADSR_RPS0_B_0X1								(0x1u<<8)
#define	ETH_DMADSR_RPS0_B_0X3								(0x3u<<8)
#define	ETH_DMADSR_RPS0_B_0X4								(0x4u<<8)
#define	ETH_DMADSR_RPS0_B_0X5								(0x5u<<8)
#define	ETH_DMADSR_RPS0_B_0X6								(0x6u<<8)
#define	ETH_DMADSR_RPS0_B_0X7								(0x7u<<8)

// DMAA4TXACR Configuration

#define	ETH_DMAA4TXACR_THC									(0xFu<<16)
#define	ETH_DMAA4TXACR_THC_0								(0x1u<<16)
#define	ETH_DMAA4TXACR_TEC									(0xFu<<8)
#define	ETH_DMAA4TXACR_TEC_0								(0x1u<<8)
#define	ETH_DMAA4TXACR_TDRC									(0xFu<<0)
#define	ETH_DMAA4TXACR_TDRC_0								(0x1u<<0)

// DMAA4RXACR Configuration

#define	ETH_DMAA4RXACR_RDC									(0xFu<<24)
#define	ETH_DMAA4RXACR_RDC_0								(0x1u<<24)
#define	ETH_DMAA4RXACR_RHC									(0xFu<<16)
#define	ETH_DMAA4RXACR_RHC_0								(0x1u<<16)
#define	ETH_DMAA4RXACR_RPC									(0xFu<<8)
#define	ETH_DMAA4RXACR_RPC_0								(0x1u<<8)
#define	ETH_DMAA4RXACR_RDWC									(0xFu<<0)
#define	ETH_DMAA4RXACR_RDWC_0								(0x1u<<0)

// DMAA4DACR Configuration

#define	ETH_DMAA4DACR_RDRC									(0xFu<<8)
#define	ETH_DMAA4DACR_RDRC_0								(0x1u<<8)
#define	ETH_DMAA4DACR_TDWD									(0x3u<<4)
#define	ETH_DMAA4DACR_TDWD_0								(0x1u<<4)
#define	ETH_DMAA4DACR_TDWC									(0xFu<<0)
#define	ETH_DMAA4DACR_TDWC_0								(0x1u<<0)

// DMALPIEI Configuration

#define	ETH_DMALPIEI_LPIEI									(0xFu<<0)
#define	ETH_DMALPIEI_LPIEI_0								(0x1u<<0)

// DMATBSCTRL0R Configuration

#define	ETH_DMATBSCTRL0R_FTOS								(0xFFFFFFu<<8)
#define	ETH_DMATBSCTRL0R_FTOS_0								(0x1u<<8)
#define	ETH_DMATBSCTRL0R_FGOS								(0x7u<<4)
#define	ETH_DMATBSCTRL0R_FGOS_0								(0x1u<<4)
#define	ETH_DMATBSCTRL0R_FTOV								(0x1u<<0)

#define	ETH_DMATBSCTRL0R_FTOV_B_0X0							(0x0u<<0)
#define	ETH_DMATBSCTRL0R_FTOV_B_0X1							(0x1u<<0)

// DMAC0CR Configuration

#define	ETH_DMAC0CR_DSL										(0x7u<<18)
#define	ETH_DMAC0CR_DSL_0									(0x1u<<18)
#define	ETH_DMAC0CR_PBLX8									(0x1u<<16)
#define	ETH_DMAC0CR_MSS										(0x3FFFu<<0)
#define	ETH_DMAC0CR_MSS_0									(0x1u<<0)

// DMAC0TXCR Configuration

#define	ETH_DMAC0TXCR_EDSE									(0x1u<<28)
#define	ETH_DMAC0TXCR_TQOS									(0xFu<<24)
#define	ETH_DMAC0TXCR_TQOS_0								(0x1u<<24)
#define	ETH_DMAC0TXCR_TXPBL									(0x3Fu<<16)
#define	ETH_DMAC0TXCR_TXPBL_0								(0x1u<<16)
#define	ETH_DMAC0TXCR_IPBL									(0x1u<<15)
#define	ETH_DMAC0TXCR_TSE									(0x1u<<12)
#define	ETH_DMAC0TXCR_OSF									(0x1u<<4)
#define	ETH_DMAC0TXCR_TCW									(0x7u<<1)
#define	ETH_DMAC0TXCR_TCW_0									(0x1u<<1)
#define	ETH_DMAC0TXCR_ST									(0x1u<<0)

// DMAC0RXCR Configuration

#define	ETH_DMAC0RXCR_RPF									(0x1u<<31)
#define	ETH_DMAC0RXCR_RQOS									(0xFu<<24)
#define	ETH_DMAC0RXCR_RQOS_0								(0x1u<<24)
#define	ETH_DMAC0RXCR_RXPBL									(0x3Fu<<16)
#define	ETH_DMAC0RXCR_RXPBL_0								(0x1u<<16)
#define	ETH_DMAC0RXCR_RBSZ									(0x3FFFu<<1)
#define	ETH_DMAC0RXCR_RBSZ_0								(0x1u<<1)
#define	ETH_DMAC0RXCR_SR									(0x1u<<0)

// DMAC0TXDLAR Configuration

#define	ETH_DMAC0TXDLAR_TDESLA								(0xFFFFFFFFu<<0)
#define	ETH_DMAC0TXDLAR_TDESLA_0							(0x1u<<0)

// DMAC0RXDLAR Configuration

#define	ETH_DMAC0RXDLAR_RDESLA								(0xFFFFFFFFu<<0)
#define	ETH_DMAC0RXDLAR_RDESLA_0							(0x1u<<0)

// DMAC0TXDTPR Configuration

#define	ETH_DMAC0TXDTPR_TDT									(0xFFFFFFFFu<<0)
#define	ETH_DMAC0TXDTPR_TDT_0								(0x1u<<0)

// DMAC0RXDTPR Configuration

#define	ETH_DMAC0RXDTPR_RDT									(0xFFFFFFFFu<<0)
#define	ETH_DMAC0RXDTPR_RDT_0								(0x1u<<0)

// DMAC0TXRLR Configuration

#define	ETH_DMAC0TXRLR_TDRL									(0x3FFu<<0)
#define	ETH_DMAC0TXRLR_TDRL_0								(0x1u<<0)

// DMAC0RXRLR Configuration

#define	ETH_DMAC0RXRLR_ARBS									(0x7Fu<<17)
#define	ETH_DMAC0RXRLR_ARBS_0								(0x1u<<17)
#define	ETH_DMAC0RXRLR_RDRL									(0x3FFu<<0)
#define	ETH_DMAC0RXRLR_RDRL_0								(0x1u<<0)

// DMAC0IER Configuration

#define	ETH_DMAC0IER_NIE									(0x1u<<15)
#define	ETH_DMAC0IER_AIE									(0x1u<<14)
#define	ETH_DMAC0IER_CDEE									(0x1u<<13)
#define	ETH_DMAC0IER_FBEE									(0x1u<<12)
#define	ETH_DMAC0IER_ERIE									(0x1u<<11)
#define	ETH_DMAC0IER_ETIE									(0x1u<<10)
#define	ETH_DMAC0IER_RWTE									(0x1u<<9)
#define	ETH_DMAC0IER_RSE									(0x1u<<8)
#define	ETH_DMAC0IER_RBUE									(0x1u<<7)
#define	ETH_DMAC0IER_RIE									(0x1u<<6)
#define	ETH_DMAC0IER_TBUE									(0x1u<<2)
#define	ETH_DMAC0IER_TXSE									(0x1u<<1)
#define	ETH_DMAC0IER_TIE									(0x1u<<0)

