hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_eth.h
// DMAC0RXIWTR Configuration

#define	ETH_DMAC0RXIWTR_RWTU								(0x3u<<16)
#define	ETH_DMAC0RXIWTR_RWTU_0								(0x1u<<16)
#define	ETH_DMAC0RXIWTR_RWT									(0xFFu<<0)
#define	ETH_DMAC0RXIWTR_RWT_0								(0x1u<<0)

#define	ETH_DMAC0RXIWTR_RWTU_B_0X0							(0x0u<<16)
#define	ETH_DMAC0RXIWTR_RWTU_B_0X1							(0x1u<<16)
#define	ETH_DMAC0RXIWTR_RWTU_B_0X2							(0x2u<<16)
#define	ETH_DMAC0RXIWTR_RWTU_B_0X3							(0x3u<<16)

// DMAC0SFCSR Configuration

#define	ETH_DMAC0SFCSR_RSN									(0xFu<<16)
#define	ETH_DMAC0SFCSR_RSN_0								(0x1u<<16)
#define	ETH_DMAC0SFCSR_SIV									(0xFFFu<<4)
#define	ETH_DMAC0SFCSR_SIV_0								(0x1u<<4)
#define	ETH_DMAC0SFCSR_ASC									(0x1u<<1)
#define	ETH_DMAC0SFCSR_ESC									(0x1u<<0)

// DMAC0CATXDR Configuration

#define	ETH_DMAC0CATXDR_CURTDESAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC0CATXDR_CURTDESAPTR_0						(0x1u<<0)

// DMAC0CARXDR Configuration

#define	ETH_DMAC0CARXDR_CURRDESAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC0CARXDR_CURRDESAPTR_0						(0x1u<<0)

// DMAC0CATXBR Configuration

#define	ETH_DMAC0CATXBR_CURTBUFAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC0CATXBR_CURTBUFAPTR_0						(0x1u<<0)

// DMAC0CARXBR Configuration

#define	ETH_DMAC0CARXBR_CURRBUFAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC0CARXBR_CURRBUFAPTR_0						(0x1u<<0)

// DMAC0SR Configuration

#define	ETH_DMAC0SR_REB										(0x7u<<19)
#define	ETH_DMAC0SR_REB_0									(0x1u<<19)
#define	ETH_DMAC0SR_TEB										(0x7u<<16)
#define	ETH_DMAC0SR_TEB_0									(0x1u<<16)
#define	ETH_DMAC0SR_NIS										(0x1u<<15)
#define	ETH_DMAC0SR_AIS										(0x1u<<14)
#define	ETH_DMAC0SR_CDE										(0x1u<<13)
#define	ETH_DMAC0SR_FBE										(0x1u<<12)
#define	ETH_DMAC0SR_ERI										(0x1u<<11)
#define	ETH_DMAC0SR_ETI										(0x1u<<10)
#define	ETH_DMAC0SR_RWT										(0x1u<<9)
#define	ETH_DMAC0SR_RPS										(0x1u<<8)
#define	ETH_DMAC0SR_RBU										(0x1u<<7)
#define	ETH_DMAC0SR_RI										(0x1u<<6)
#define	ETH_DMAC0SR_TBU										(0x1u<<2)
#define	ETH_DMAC0SR_TPS										(0x1u<<1)
#define	ETH_DMAC0SR_TI										(0x1u<<0)

// DMAC0MFCR Configuration

#define	ETH_DMAC0MFCR_MFCO									(0x1u<<15)
#define	ETH_DMAC0MFCR_MFC									(0x7FFu<<0)
#define	ETH_DMAC0MFCR_MFC_0									(0x1u<<0)

// DMAC1CR Configuration

#define	ETH_DMAC1CR_DSL										(0x7u<<18)
#define	ETH_DMAC1CR_DSL_0									(0x1u<<18)
#define	ETH_DMAC1CR_PBLX8									(0x1u<<16)
#define	ETH_DMAC1CR_MSS										(0x3FFFu<<0)
#define	ETH_DMAC1CR_MSS_0									(0x1u<<0)

// DMAC1TXCR Configuration

#define	ETH_DMAC1TXCR_EDSE									(0x1u<<28)
#define	ETH_DMAC1TXCR_TQOS									(0xFu<<24)
#define	ETH_DMAC1TXCR_TQOS_0								(0x1u<<24)
#define	ETH_DMAC1TXCR_TXPBL									(0x3Fu<<16)
#define	ETH_DMAC1TXCR_TXPBL_0								(0x1u<<16)
#define	ETH_DMAC1TXCR_IPBL									(0x1u<<15)
#define	ETH_DMAC1TXCR_TSE									(0x1u<<12)
#define	ETH_DMAC1TXCR_OSF									(0x1u<<4)
#define	ETH_DMAC1TXCR_TCW									(0x7u<<1)
#define	ETH_DMAC1TXCR_TCW_0									(0x1u<<1)
#define	ETH_DMAC1TXCR_ST									(0x1u<<0)

// DMAC1RXCR Configuration

#define	ETH_DMAC1RXCR_RPF									(0x1u<<31)
#define	ETH_DMAC1RXCR_RQOS									(0xFu<<24)
#define	ETH_DMAC1RXCR_RQOS_0								(0x1u<<24)
#define	ETH_DMAC1RXCR_RXPBL									(0x3Fu<<16)
#define	ETH_DMAC1RXCR_RXPBL_0								(0x1u<<16)
#define	ETH_DMAC1RXCR_RBSZ									(0x3FFFu<<1)
#define	ETH_DMAC1RXCR_RBSZ_0								(0x1u<<1)
#define	ETH_DMAC1RXCR_SR									(0x1u<<0)

// DMAC1TXDLAR Configuration

#define	ETH_DMAC1TXDLAR_TDESLA								(0xFFFFFFFFu<<0)
#define	ETH_DMAC1TXDLAR_TDESLA_0							(0x1u<<0)

// DMAC1TXDTPR Configuration

#define	ETH_DMAC1TXDTPR_TDT									(0xFFFFFFFFu<<0)
#define	ETH_DMAC1TXDTPR_TDT_0								(0x1u<<0)

// DMAC1RXDTPR Configuration

#define	ETH_DMAC1RXDTPR_RDT									(0xFFFFFFFFu<<0)
#define	ETH_DMAC1RXDTPR_RDT_0								(0x1u<<0)

// DMAC1TXRLR Configuration

#define	ETH_DMAC1TXRLR_TDRL									(0x3FFu<<0)
#define	ETH_DMAC1TXRLR_TDRL_0								(0x1u<<0)

// DMAC1RXRLR Configuration

#define	ETH_DMAC1RXRLR_ARBS									(0x7Fu<<17)
#define	ETH_DMAC1RXRLR_ARBS_0								(0x1u<<17)
#define	ETH_DMAC1RXRLR_RDRL									(0x3FFu<<0)
#define	ETH_DMAC1RXRLR_RDRL_0								(0x1u<<0)

// DMAC1IER Configuration

#define	ETH_DMAC1IER_NIE									(0x1u<<15)
#define	ETH_DMAC1IER_AIE									(0x1u<<14)
#define	ETH_DMAC1IER_CDEE									(0x1u<<13)
#define	ETH_DMAC1IER_FBEE									(0x1u<<12)
#define	ETH_DMAC1IER_ERIE									(0x1u<<11)
#define	ETH_DMAC1IER_ETIE									(0x1u<<10)
#define	ETH_DMAC1IER_RWTE									(0x1u<<9)
#define	ETH_DMAC1IER_RSE									(0x1u<<8)
#define	ETH_DMAC1IER_RBUE									(0x1u<<7)
#define	ETH_DMAC1IER_RIE									(0x1u<<6)
#define	ETH_DMAC1IER_TBUE									(0x1u<<2)
#define	ETH_DMAC1IER_TXSE									(0x1u<<1)
#define	ETH_DMAC1IER_TIE									(0x1u<<0)

// DMAC1RXIWTR Configuration

#define	ETH_DMAC1RXIWTR_RWTU								(0x3u<<16)
#define	ETH_DMAC1RXIWTR_RWTU_0								(0x1u<<16)
#define	ETH_DMAC1RXIWTR_RWT									(0xFFu<<0)
#define	ETH_DMAC1RXIWTR_RWT_0								(0x1u<<0)

#define	ETH_DMAC1RXIWTR_RWTU_B_0X0							(0x0u<<16)
#define	ETH_DMAC1RXIWTR_RWTU_B_0X1							(0x1u<<16)
#define	ETH_DMAC1RXIWTR_RWTU_B_0X2							(0x2u<<16)
#define	ETH_DMAC1RXIWTR_RWTU_B_0X3							(0x3u<<16)

// DMAC1SFCSR Configuration

#define	ETH_DMAC1SFCSR_RSN									(0xFu<<16)
#define	ETH_DMAC1SFCSR_RSN_0								(0x1u<<16)
#define	ETH_DMAC1SFCSR_SIV									(0xFFFu<<4)
#define	ETH_DMAC1SFCSR_SIV_0								(0x1u<<4)
#define	ETH_DMAC1SFCSR_ASC									(0x1u<<1)
#define	ETH_DMAC1SFCSR_ESC									(0x1u<<0)

// DMAC1CATXDR Configuration

#define	ETH_DMAC1CATXDR_CURTDESAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC1CATXDR_CURTDESAPTR_0						(0x1u<<0)

// DMAC1CARXDR Configuration

#define	ETH_DMAC1CARXDR_CURRDESAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC1CARXDR_CURRDESAPTR_0						(0x1u<<0)

// DMAC1CATXBR Configuration

#define	ETH_DMAC1CATXBR_CURTBUFAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC1CATXBR_CURTBUFAPTR_0						(0x1u<<0)

// DMAC1CARXBR Configuration

#define	ETH_DMAC1CARXBR_CURRBUFAPTR							(0xFFFFFFFFu<<0)
#define	ETH_DMAC1CARXBR_CURRBUFAPTR_0						(0x1u<<0)

// DMAC1SR Configuration

#define	ETH_DMAC1SR_REB										(0x7u<<19)
#define	ETH_DMAC1SR_REB_0									(0x1u<<19)
#define	ETH_DMAC1SR_TEB										(0x7u<<16)
#define	ETH_DMAC1SR_TEB_0									(0x1u<<16)
#define	ETH_DMAC1SR_NIS										(0x1u<<15)
#define	ETH_DMAC1SR_AIS										(0x1u<<14)
#define	ETH_DMAC1SR_CDE										(0x1u<<13)
#define	ETH_DMAC1SR_FBE										(0x1u<<12)
#define	ETH_DMAC1SR_ERI										(0x1u<<11)
#define	ETH_DMAC1SR_ETI										(0x1u<<10)
#define	ETH_DMAC1SR_RWT										(0x1u<<9)
#define	ETH_DMAC1SR_RPS										(0x1u<<8)
#define	ETH_DMAC1SR_RBU										(0x1u<<7)
#define	ETH_DMAC1SR_RI										(0x1u<<6)
#define	ETH_DMAC1SR_TBU										(0x1u<<2)
#define	ETH_DMAC1SR_TPS										(0x1u<<1)
#define	ETH_DMAC1SR_TI										(0x1u<<0)

// DMAC1MFCR Configuration

#define	ETH_DMAC1MFCR_MFCO									(0x1u<<15)
#define	ETH_DMAC1MFCR_MFC									(0x7FFu<<0)
#define	ETH_DMAC1MFCR_MFC_0									(0x1u<<0)
